the-nw1-group/acb-modules/acb-common/include/stm/stm32l431xx.inc
@ File automatically generated from D:\Model Railways\Electronics\ArmProjects\misc\generatedProjects\l431test\Drivers\CMSIS\Device\ST\STM32L4xx\Include\stm32l431xx.h on 18/01/2021 16:02:35
@ by ConvertHeaderFiles (c) The NW1 Group

/**
  ******************************************************************************
  * @file    stm32l431xx.h
  * @author  MCD Application Team
  * @brief   CMSIS STM32L431xx Device Peripheral Access Layer Header File.
  *
  *          This file contains:
  *           - Data structures and the address mapping for all peripherals
  *           - Peripheral's registers declarations and bits definition
  *           - Macros to access peripheral�s registers hardware
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Apache License, Version 2.0,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/Apache-2.0
  *
  ******************************************************************************
  */

/** @addtogroup CMSIS_Device
  * @{
  */

/** @addtogroup stm32l431xx
  * @{
  */

#ifndef __STM32L431xx_H
#define __STM32L431xx_H

#ifdef __cplusplus
#endif /* __cplusplus */

/** @addtogroup Configuration_section_for_CMSIS
  * @{
  */

/**
  * @brief Configuration of the Cortex-M4 Processor and Core Peripherals
   */
#define __CM4_REV                 0x0001  /*!< Cortex-M4 revision r0p1                       */
#define __MPU_PRESENT             1       /*!< STM32L4XX provides an MPU                     */
#define __NVIC_PRIO_BITS          4       /*!< STM32L4XX uses 4 Bits for the Priority Levels */
#define __Vendor_SysTickConfig    0       /*!< Set to 1 if different SysTick Config is used  */
#define __FPU_PRESENT             1       /*!< FPU present                                   */

/**
  * @}
  */

/** @addtogroup Peripheral_interrupt_number_definition
  * @{
  */

/**
 * @brief STM32L4XX Interrupt Number Definition, according to the selected device
 *        in @ref Library_configuration_section
 */
  NonMaskableInt_IRQn         = -14    /*!< 2 Cortex-M4 Non Maskable Interrupt                                */
  HardFault_IRQn              = -13    /*!< 3 Cortex-M4 Hard Fault Interrupt                                  */
  MemoryManagement_IRQn       = -12    /*!< 4 Cortex-M4 Memory Management Interrupt                           */
  BusFault_IRQn               = -11    /*!< 5 Cortex-M4 Bus Fault Interrupt                                   */
  UsageFault_IRQn             = -10    /*!< 6 Cortex-M4 Usage Fault Interrupt                                 */
  SVCall_IRQn                 = -5     /*!< 11 Cortex-M4 SV Call Interrupt                                    */
  DebugMonitor_IRQn           = -4     /*!< 12 Cortex-M4 Debug Monitor Interrupt                              */
  PendSV_IRQn                 = -2     /*!< 14 Cortex-M4 Pend SV Interrupt                                    */
  SysTick_IRQn                = -1     /*!< 15 Cortex-M4 System Tick Interrupt                                */
  WWDG_IRQn                   = 0      /*!< Window WatchDog Interrupt                                         */
  PVD_PVM_IRQn                = 1      /*!< PVD/PVM3/PVM4 through EXTI Line detection Interrupts              */
  TAMP_STAMP_IRQn             = 2      /*!< Tamper and TimeStamp interrupts through the EXTI line             */
  RTC_WKUP_IRQn               = 3      /*!< RTC Wakeup interrupt through the EXTI line                        */
  FLASH_IRQn                  = 4      /*!< FLASH global Interrupt                                            */
  RCC_IRQn                    = 5      /*!< RCC global Interrupt                                              */
  EXTI0_IRQn                  = 6      /*!< EXTI Line0 Interrupt                                              */
  EXTI1_IRQn                  = 7      /*!< EXTI Line1 Interrupt                                              */
  EXTI2_IRQn                  = 8      /*!< EXTI Line2 Interrupt                                              */
  EXTI3_IRQn                  = 9      /*!< EXTI Line3 Interrupt                                              */
  EXTI4_IRQn                  = 10     /*!< EXTI Line4 Interrupt                                              */
  DMA1_Channel1_IRQn          = 11     /*!< DMA1 Channel 1 global Interrupt                                   */
  DMA1_Channel2_IRQn          = 12     /*!< DMA1 Channel 2 global Interrupt                                   */
  DMA1_Channel3_IRQn          = 13     /*!< DMA1 Channel 3 global Interrupt                                   */
  DMA1_Channel4_IRQn          = 14     /*!< DMA1 Channel 4 global Interrupt                                   */
  DMA1_Channel5_IRQn          = 15     /*!< DMA1 Channel 5 global Interrupt                                   */
  DMA1_Channel6_IRQn          = 16     /*!< DMA1 Channel 6 global Interrupt                                   */
  DMA1_Channel7_IRQn          = 17     /*!< DMA1 Channel 7 global Interrupt                                   */
  ADC1_IRQn                   = 18     /*!< ADC1 global Interrupt                                             */
  CAN1_TX_IRQn                = 19     /*!< CAN1 TX Interrupt                                                 */
  CAN1_RX0_IRQn               = 20     /*!< CAN1 RX0 Interrupt                                                */
  CAN1_RX1_IRQn               = 21     /*!< CAN1 RX1 Interrupt                                                */
  CAN1_SCE_IRQn               = 22     /*!< CAN1 SCE Interrupt                                                */
  EXTI9_5_IRQn                = 23     /*!< External Line[9:5] Interrupts                                     */
  TIM1_BRK_TIM15_IRQn         = 24     /*!< TIM1 Break interrupt and TIM15 global interrupt                   */
  TIM1_UP_TIM16_IRQn          = 25     /*!< TIM1 Update Interrupt and TIM16 global interrupt                  */
  TIM1_TRG_COM_IRQn           = 26     /*!< TIM1 Trigger and Commutation Interrupt                            */
  TIM1_CC_IRQn                = 27     /*!< TIM1 Capture Compare Interrupt                                    */
  TIM2_IRQn                   = 28     /*!< TIM2 global Interrupt                                             */
  I2C1_EV_IRQn                = 31     /*!< I2C1 Event Interrupt                                              */
  I2C1_ER_IRQn                = 32     /*!< I2C1 Error Interrupt                                              */
  I2C2_EV_IRQn                = 33     /*!< I2C2 Event Interrupt                                              */
  I2C2_ER_IRQn                = 34     /*!< I2C2 Error Interrupt                                              */
  SPI1_IRQn                   = 35     /*!< SPI1 global Interrupt                                             */
  SPI2_IRQn                   = 36     /*!< SPI2 global Interrupt                                             */
  USART1_IRQn                 = 37     /*!< USART1 global Interrupt                                           */
  USART2_IRQn                 = 38     /*!< USART2 global Interrupt                                           */
  USART3_IRQn                 = 39     /*!< USART3 global Interrupt                                           */
  EXTI15_10_IRQn              = 40     /*!< External Line[15:10] Interrupts                                   */
  RTC_Alarm_IRQn              = 41     /*!< RTC Alarm (A and B) through EXTI Line Interrupt                   */
  SDMMC1_IRQn                 = 49     /*!< SDMMC1 global Interrupt                                           */
  SPI3_IRQn                   = 51     /*!< SPI3 global Interrupt                                             */
  TIM6_DAC_IRQn               = 54     /*!< TIM6 global and DAC1&2 underrun error  interrupts                 */
  TIM7_IRQn                   = 55     /*!< TIM7 global interrupt                                             */
  DMA2_Channel1_IRQn          = 56     /*!< DMA2 Channel 1 global Interrupt                                   */
  DMA2_Channel2_IRQn          = 57     /*!< DMA2 Channel 2 global Interrupt                                   */
  DMA2_Channel3_IRQn          = 58     /*!< DMA2 Channel 3 global Interrupt                                   */
  DMA2_Channel4_IRQn          = 59     /*!< DMA2 Channel 4 global Interrupt                                   */
  DMA2_Channel5_IRQn          = 60     /*!< DMA2 Channel 5 global Interrupt                                   */
  COMP_IRQn                   = 64     /*!< COMP1 and COMP2 Interrupts                                        */
  LPTIM1_IRQn                 = 65     /*!< LP TIM1 interrupt                                                 */
  LPTIM2_IRQn                 = 66     /*!< LP TIM2 interrupt                                                 */
  DMA2_Channel6_IRQn          = 68     /*!< DMA2 Channel 6 global interrupt                                   */
  DMA2_Channel7_IRQn          = 69     /*!< DMA2 Channel 7 global interrupt                                   */
  LPUART1_IRQn                = 70     /*!< LP UART1 interrupt                                                */
  QUADSPI_IRQn                = 71     /*!< Quad SPI global interrupt                                         */
  I2C3_EV_IRQn                = 72     /*!< I2C3 event interrupt                                              */
  I2C3_ER_IRQn                = 73     /*!< I2C3 error interrupt                                              */
  SAI1_IRQn                   = 74     /*!< Serial Audio Interface 1 global interrupt                         */
  SWPMI1_IRQn                 = 76     /*!< Serial Wire Interface 1 global interrupt                          */
  TSC_IRQn                    = 77     /*!< Touch Sense Controller global interrupt                           */
  RNG_IRQn                    = 80     /*!< RNG global interrupt                                              */
  FPU_IRQn                    = 81     /*!< FPU global interrupt                                              */
  CRS_IRQn                    = 82      /*!< CRS global interrupt                                              */

/**
  * @}
  */


