the-nw1-group/acb-modules/acb-common/include/stm/stm32l431xx.inc
/** @addtogroup Peripheral_registers_structures
  * @{
  */

/**
  * @brief Analog to Digital Converter
  */


#define ADC_ISR_OFFSET          0x0000    /*!< ADC interrupt and status register,             Address offset: 0x00 */
#define ADC_IER_OFFSET          0x0004    /*!< ADC interrupt enable register,                 Address offset: 0x04 */
#define ADC_CR_OFFSET           0x0008    /*!< ADC control register,                          Address offset: 0x08 */
#define ADC_CFGR_OFFSET         0x000C    /*!< ADC configuration register 1,                  Address offset: 0x0C */
#define ADC_CFGR2_OFFSET        0x0010    /*!< ADC configuration register 2,                  Address offset: 0x10 */
#define ADC_SMPR1_OFFSET        0x0014    /*!< ADC sampling time register 1,                  Address offset: 0x14 */
#define ADC_SMPR2_OFFSET        0x0018    /*!< ADC sampling time register 2,                  Address offset: 0x18 */
#define ADC_RESERVED1_OFFSET    0x001C    /*!< Reserved,                                                      0x1C */
#define ADC_TR1_OFFSET          0x0020    /*!< ADC analog watchdog 1 threshold register,      Address offset: 0x20 */
#define ADC_TR2_OFFSET          0x0024    /*!< ADC analog watchdog 2 threshold register,      Address offset: 0x24 */
#define ADC_TR3_OFFSET          0x0028    /*!< ADC analog watchdog 3 threshold register,      Address offset: 0x28 */
#define ADC_RESERVED2_OFFSET    0x002C    /*!< Reserved,                                                      0x2C */
#define ADC_SQR1_OFFSET         0x0030    /*!< ADC group regular sequencer register 1,        Address offset: 0x30 */
#define ADC_SQR2_OFFSET         0x0034    /*!< ADC group regular sequencer register 2,        Address offset: 0x34 */
#define ADC_SQR3_OFFSET         0x0038    /*!< ADC group regular sequencer register 3,        Address offset: 0x38 */
#define ADC_SQR4_OFFSET         0x003C    /*!< ADC group regular sequencer register 4,        Address offset: 0x3C */
#define ADC_DR_OFFSET           0x0040    /*!< ADC group regular data register,               Address offset: 0x40 */
#define ADC_RESERVED3_OFFSET    0x0044    /*!< Reserved,                                                      0x44 */
#define ADC_RESERVED4_OFFSET    0x0048    /*!< Reserved,                                                      0x48 */
#define ADC_JSQR_OFFSET         0x004C    /*!< ADC group injected sequencer register,         Address offset: 0x4C */
#define ADC_RESERVED5_OFFSET    0x0050    /*!< Reserved,                                               0x50 - 0x5C */
#define ADC_OFR1_OFFSET         0x0060    /*!< ADC offset register 1,                         Address offset: 0x60 */
#define ADC_OFR2_OFFSET         0x0064    /*!< ADC offset register 2,                         Address offset: 0x64 */
#define ADC_OFR3_OFFSET         0x0068    /*!< ADC offset register 3,                         Address offset: 0x68 */
#define ADC_OFR4_OFFSET         0x006C    /*!< ADC offset register 4,                         Address offset: 0x6C */
#define ADC_RESERVED6_OFFSET    0x0070    /*!< Reserved,                                               0x70 - 0x7C */
#define ADC_JDR1_OFFSET         0x0080    /*!< ADC group injected rank 1 data register,       Address offset: 0x80 */
#define ADC_JDR2_OFFSET         0x0084    /*!< ADC group injected rank 2 data register,       Address offset: 0x84 */
#define ADC_JDR3_OFFSET         0x0088    /*!< ADC group injected rank 3 data register,       Address offset: 0x88 */
#define ADC_JDR4_OFFSET         0x008C    /*!< ADC group injected rank 4 data register,       Address offset: 0x8C */
#define ADC_RESERVED7_OFFSET    0x0090    /*!< Reserved,                                             0x090 - 0x09C */
#define ADC_AWD2CR_OFFSET       0x00A0    /*!< ADC analog watchdog 1 configuration register,  Address offset: 0xA0 */
#define ADC_AWD3CR_OFFSET       0x00A4    /*!< ADC analog watchdog 3 Configuration Register,  Address offset: 0xA4 */
#define ADC_RESERVED8_OFFSET    0x00A8    /*!< Reserved,                                                     0x0A8 */
#define ADC_RESERVED9_OFFSET    0x00AC    /*!< Reserved,                                                     0x0AC */
#define ADC_DIFSEL_OFFSET       0x00B0    /*!< ADC differential mode selection register,      Address offset: 0xB0 */
#define ADC_CALFACT_OFFSET      0x00B4    /*!< ADC calibration factors,                       Address offset: 0xB4 */

#define ADC_Common_RESERVED1_OFFSET    0x0000    /*!< Reserved,                                      Address offset: ADC1 base address + 0x300 */
#define ADC_Common_RESERVED2_OFFSET    0x0004    /*!< Reserved,                                      Address offset: ADC1 base address + 0x304 */
#define ADC_Common_CCR_OFFSET          0x0008    /*!< ADC common configuration register,             Address offset: ADC1 base address + 0x308 */
#define ADC_Common_RESERVED3_OFFSET    0x000C    /*!< Reserved,                                      Address offset: ADC1 base address + 0x30C */


/**
  * @brief Controller Area Network TxMailBox
  */

#define CAN_TxMailBox_TIR_OFFSET     0x0000    /*!< CAN TX mailbox identifier register */
#define CAN_TxMailBox_TDTR_OFFSET    0x0004    /*!< CAN mailbox data length control and time stamp register */
#define CAN_TxMailBox_TDLR_OFFSET    0x0008    /*!< CAN mailbox data low register */
#define CAN_TxMailBox_TDHR_OFFSET    0x000C    /*!< CAN mailbox data high register */

/**
  * @brief Controller Area Network FIFOMailBox
  */

#define CAN_FIFOMailBox_RIR_OFFSET     0x0000    /*!< CAN receive FIFO mailbox identifier register */
#define CAN_FIFOMailBox_RDTR_OFFSET    0x0004    /*!< CAN receive FIFO mailbox data length control and time stamp register */
#define CAN_FIFOMailBox_RDLR_OFFSET    0x0008    /*!< CAN receive FIFO mailbox data low register */
#define CAN_FIFOMailBox_RDHR_OFFSET    0x000C    /*!< CAN receive FIFO mailbox data high register */

/**
  * @brief Controller Area Network FilterRegister
  */

#define CAN_FilterRegister_FR1_OFFSET    0x0000    /*!< CAN Filter bank register 1 */
#define CAN_FilterRegister_FR2_OFFSET    0x0004    /*!< CAN Filter bank register 1 */

/**
  * @brief Controller Area Network
  */

#define CAN_MCR_OFFSET                0x0000    /*!< CAN master control register,         Address offset: 0x00          */
#define CAN_MSR_OFFSET                0x0004    /*!< CAN master status register,          Address offset: 0x04          */
#define CAN_TSR_OFFSET                0x0008    /*!< CAN transmit status register,        Address offset: 0x08          */
#define CAN_RF0R_OFFSET               0x000C    /*!< CAN receive FIFO 0 register,         Address offset: 0x0C          */
#define CAN_RF1R_OFFSET               0x0010    /*!< CAN receive FIFO 1 register,         Address offset: 0x10          */
#define CAN_IER_OFFSET                0x0014    /*!< CAN interrupt enable register,       Address offset: 0x14          */
#define CAN_ESR_OFFSET                0x0018    /*!< CAN error status register,           Address offset: 0x18          */
#define CAN_BTR_OFFSET                0x001C    /*!< CAN bit timing register,             Address offset: 0x1C          */
#define CAN_RESERVED0_OFFSET          0x0020    /*!< Reserved, 0x020 - 0x17F                                            */
#define CAN_sTxMailBox_OFFSET         0x0180    /*!< CAN Tx MailBox,                      Address offset: 0x180 - 0x1AC */
#define CAN_sFIFOMailBox_OFFSET       0x01B0    /*!< CAN FIFO MailBox,                    Address offset: 0x1B0 - 0x1CC */
#define CAN_RESERVED1_OFFSET          0x01D0    /*!< Reserved, 0x1D0 - 0x1FF                                            */
#define CAN_FMR_OFFSET                0x0200    /*!< CAN filter master register,          Address offset: 0x200         */
#define CAN_FM1R_OFFSET               0x0204    /*!< CAN filter mode register,            Address offset: 0x204         */
#define CAN_RESERVED2_OFFSET          0x0208    /*!< Reserved, 0x208                                                    */
#define CAN_FS1R_OFFSET               0x020C    /*!< CAN filter scale register,           Address offset: 0x20C         */
#define CAN_RESERVED3_OFFSET          0x0210    /*!< Reserved, 0x210                                                    */
#define CAN_FFA1R_OFFSET              0x0214    /*!< CAN filter FIFO assignment register, Address offset: 0x214         */
#define CAN_RESERVED4_OFFSET          0x0218    /*!< Reserved, 0x218                                                    */
#define CAN_FA1R_OFFSET               0x021C    /*!< CAN filter activation register,      Address offset: 0x21C         */
#define CAN_RESERVED5_OFFSET          0x0220    /*!< Reserved, 0x220-0x23F                                              */
#define CAN_sFilterRegister_OFFSET    0x0240    /*!< CAN Filter Register,                 Address offset: 0x240-0x31C   */


/**
  * @brief Comparator
  */

#define COMP_CSR_OFFSET    0x0000    /*!< COMP control and status register, Address offset: 0x00 */

#define COMP_Common_CSR_OFFSET    0x0000    /*!< COMP control and status register, used for bits common to several COMP instances, Address offset: 0x00 */

/**
  * @brief CRC calculation unit
  */

