the-nw1-group/acb-modules/acb-common/include/stm/stm32l431xx.inc
#define CRC_DR_OFFSET           0x0000    /*!< CRC Data register,                           Address offset: 0x00 */
#define CRC_IDR_OFFSET          0x0004    /*!< CRC Independent data register,               Address offset: 0x04 */
#define CRC_RESERVED0_OFFSET    0x0005    /*!< Reserved,                                                    0x05 */
#define CRC_RESERVED1_OFFSET    0x0006    /*!< Reserved,                                                    0x06 */
#define CRC_CR_OFFSET           0x0008    /*!< CRC Control register,                        Address offset: 0x08 */
#define CRC_RESERVED2_OFFSET    0x000C    /*!< Reserved,                                                    0x0C */
#define CRC_INIT_OFFSET         0x0010    /*!< Initial CRC value register,                  Address offset: 0x10 */
#define CRC_POL_OFFSET          0x0014    /*!< CRC polynomial register,                     Address offset: 0x14 */

/**
  * @brief Clock Recovery System
  */
#define CRS_CR_OFFSET      0x0000    /*!< CRS ccontrol register,              Address offset: 0x00 */
#define CRS_CFGR_OFFSET    0x0004    /*!< CRS configuration register,         Address offset: 0x04 */
#define CRS_ISR_OFFSET     0x0008    /*!< CRS interrupt and status register,  Address offset: 0x08 */
#define CRS_ICR_OFFSET     0x000C    /*!< CRS interrupt flag clear register,  Address offset: 0x0C */

/**
  * @brief Digital to Analog Converter
  */

#define DAC_CR_OFFSET         0x0000    /*!< DAC control register,                                    Address offset: 0x00 */
#define DAC_SWTRIGR_OFFSET    0x0004    /*!< DAC software trigger register,                           Address offset: 0x04 */
#define DAC_DHR12R1_OFFSET    0x0008    /*!< DAC channel1 12-bit right-aligned data holding register, Address offset: 0x08 */
#define DAC_DHR12L1_OFFSET    0x000C    /*!< DAC channel1 12-bit left aligned data holding register,  Address offset: 0x0C */
#define DAC_DHR8R1_OFFSET     0x0010    /*!< DAC channel1 8-bit right aligned data holding register,  Address offset: 0x10 */
#define DAC_DHR12R2_OFFSET    0x0014    /*!< DAC channel2 12-bit right aligned data holding register, Address offset: 0x14 */
#define DAC_DHR12L2_OFFSET    0x0018    /*!< DAC channel2 12-bit left aligned data holding register,  Address offset: 0x18 */
#define DAC_DHR8R2_OFFSET     0x001C    /*!< DAC channel2 8-bit right-aligned data holding register,  Address offset: 0x1C */
#define DAC_DHR12RD_OFFSET    0x0020    /*!< Dual DAC 12-bit right-aligned data holding register,     Address offset: 0x20 */
#define DAC_DHR12LD_OFFSET    0x0024    /*!< DUAL DAC 12-bit left aligned data holding register,      Address offset: 0x24 */
#define DAC_DHR8RD_OFFSET     0x0028    /*!< DUAL DAC 8-bit right aligned data holding register,      Address offset: 0x28 */
#define DAC_DOR1_OFFSET       0x002C    /*!< DAC channel1 data output register,                       Address offset: 0x2C */
#define DAC_DOR2_OFFSET       0x0030    /*!< DAC channel2 data output register,                       Address offset: 0x30 */
#define DAC_SR_OFFSET         0x0034    /*!< DAC status register,                                     Address offset: 0x34 */
#define DAC_CCR_OFFSET        0x0038    /*!< DAC calibration control register,                        Address offset: 0x38 */
#define DAC_MCR_OFFSET        0x003C    /*!< DAC mode control register,                               Address offset: 0x3C */
#define DAC_SHSR1_OFFSET      0x0040    /*!< DAC Sample and Hold sample time register 1,              Address offset: 0x40 */
#define DAC_SHSR2_OFFSET      0x0044    /*!< DAC Sample and Hold sample time register 2,              Address offset: 0x44 */
#define DAC_SHHR_OFFSET       0x0048    /*!< DAC Sample and Hold hold time register,                  Address offset: 0x48 */
#define DAC_SHRR_OFFSET       0x004C    /*!< DAC Sample and Hold refresh time register,               Address offset: 0x4C */


/**
  * @brief Debug MCU
  */

#define DBGMCU_IDCODE_OFFSET      0x0000    /*!< MCU device ID code,                 Address offset: 0x00 */
#define DBGMCU_CR_OFFSET          0x0004    /*!< Debug MCU configuration register,   Address offset: 0x04 */
#define DBGMCU_APB1FZR1_OFFSET    0x0008    /*!< Debug MCU APB1 freeze register 1,   Address offset: 0x08 */
#define DBGMCU_APB1FZR2_OFFSET    0x000C    /*!< Debug MCU APB1 freeze register 2,   Address offset: 0x0C */
#define DBGMCU_APB2FZ_OFFSET      0x0010    /*!< Debug MCU APB2 freeze register,     Address offset: 0x10 */


/**
  * @brief DMA Controller
  */

#define DMA_Channel_CCR_OFFSET      0x0000    /*!< DMA channel x configuration register        */
#define DMA_Channel_CNDTR_OFFSET    0x0004    /*!< DMA channel x number of data register       */
#define DMA_Channel_CPAR_OFFSET     0x0008    /*!< DMA channel x peripheral address register   */
#define DMA_Channel_CMAR_OFFSET     0x000C    /*!< DMA channel x memory address register       */

#define DMA_ISR_OFFSET     0x0000    /*!< DMA interrupt status register,                 Address offset: 0x00 */
#define DMA_IFCR_OFFSET    0x0004    /*!< DMA interrupt flag clear register,             Address offset: 0x04 */

#define DMA_Request_CSELR_OFFSET    0x0000    /*!< DMA channel selection register              */

#define DMA_request_TypeDef  DMA_Request_TypeDef


/**
  * @brief External Interrupt/Event Controller
  */

#define EXTI_IMR1_OFFSET         0x0000    /*!< EXTI Interrupt mask register 1,             Address offset: 0x00 */
#define EXTI_EMR1_OFFSET         0x0004    /*!< EXTI Event mask register 1,                 Address offset: 0x04 */
#define EXTI_RTSR1_OFFSET        0x0008    /*!< EXTI Rising trigger selection register 1,   Address offset: 0x08 */
#define EXTI_FTSR1_OFFSET        0x000C    /*!< EXTI Falling trigger selection register 1,  Address offset: 0x0C */
#define EXTI_SWIER1_OFFSET       0x0010    /*!< EXTI Software interrupt event register 1,   Address offset: 0x10 */
#define EXTI_PR1_OFFSET          0x0014    /*!< EXTI Pending register 1,                    Address offset: 0x14 */
#define EXTI_RESERVED1_OFFSET    0x0018    /*!< Reserved, 0x18                                                   */
#define EXTI_RESERVED2_OFFSET    0x001C    /*!< Reserved, 0x1C                                                   */
#define EXTI_IMR2_OFFSET         0x0020    /*!< EXTI Interrupt mask register 2,             Address offset: 0x20 */
#define EXTI_EMR2_OFFSET         0x0024    /*!< EXTI Event mask register 2,                 Address offset: 0x24 */
#define EXTI_RTSR2_OFFSET        0x0028    /*!< EXTI Rising trigger selection register 2,   Address offset: 0x28 */
#define EXTI_FTSR2_OFFSET        0x002C    /*!< EXTI Falling trigger selection register 2,  Address offset: 0x2C */
#define EXTI_SWIER2_OFFSET       0x0030    /*!< EXTI Software interrupt event register 2,   Address offset: 0x30 */
#define EXTI_PR2_OFFSET          0x0034    /*!< EXTI Pending register 2,                    Address offset: 0x34 */


/**
  * @brief Firewall
  */

#define FIREWALL_CSSA_OFFSET         0x0000    /*!< Code Segment Start Address register,              Address offset: 0x00 */
#define FIREWALL_CSL_OFFSET          0x0004    /*!< Code Segment Length register,                      Address offset: 0x04 */
#define FIREWALL_NVDSSA_OFFSET       0x0008    /*!< NON volatile data Segment Start Address register,  Address offset: 0x08 */
#define FIREWALL_NVDSL_OFFSET        0x000C    /*!< NON volatile data Segment Length register,         Address offset: 0x0C */
#define FIREWALL_VDSSA_OFFSET        0x0010    /*!< Volatile data Segment Start Address register,      Address offset: 0x10 */
#define FIREWALL_VDSL_OFFSET         0x0014    /*!< Volatile data Segment Length register,             Address offset: 0x14 */
#define FIREWALL_RESERVED1_OFFSET    0x0018    /*!< Reserved1,                                         Address offset: 0x18 */
#define FIREWALL_RESERVED2_OFFSET    0x001C    /*!< Reserved2,                                         Address offset: 0x1C */
#define FIREWALL_CR_OFFSET           0x0020    /*!< Configuration  register,                           Address offset: 0x20 */


/**
  * @brief FLASH Registers
  */

#define FLASH_ACR_OFFSET          0x0000    /*!< FLASH access control register,            Address offset: 0x00 */
#define FLASH_PDKEYR_OFFSET       0x0004    /*!< FLASH power down key register,            Address offset: 0x04 */
#define FLASH_KEYR_OFFSET         0x0008    /*!< FLASH key register,                       Address offset: 0x08 */
#define FLASH_OPTKEYR_OFFSET      0x000C    /*!< FLASH option key register,                Address offset: 0x0C */
#define FLASH_SR_OFFSET           0x0010    /*!< FLASH status register,                    Address offset: 0x10 */
#define FLASH_CR_OFFSET           0x0014    /*!< FLASH control register,                   Address offset: 0x14 */
#define FLASH_ECCR_OFFSET         0x0018    /*!< FLASH ECC register,                       Address offset: 0x18 */
#define FLASH_RESERVED1_OFFSET    0x001C    /*!< Reserved1,                                Address offset: 0x1C */
#define FLASH_OPTR_OFFSET         0x0020    /*!< FLASH option register,                    Address offset: 0x20 */
#define FLASH_PCROP1SR_OFFSET     0x0024    /*!< FLASH bank1 PCROP start address register, Address offset: 0x24 */
#define FLASH_PCROP1ER_OFFSET     0x0028    /*!< FLASH bank1 PCROP end address register,   Address offset: 0x28 */
#define FLASH_WRP1AR_OFFSET       0x002C    /*!< FLASH bank1 WRP area A address register,  Address offset: 0x2C */
#define FLASH_WRP1BR_OFFSET       0x0030    /*!< FLASH bank1 WRP area B address register,  Address offset: 0x30 */



/**
  * @brief General Purpose I/O
  */


