the-nw1-group/acb-modules/acb-common/include/stm/stm32l431xx.inc
#define GPIO_MODER_OFFSET      0x0000    /*!< GPIO port mode register,               Address offset: 0x00      */
#define GPIO_OTYPER_OFFSET     0x0004    /*!< GPIO port output type register,        Address offset: 0x04      */
#define GPIO_OSPEEDR_OFFSET    0x0008    /*!< GPIO port output speed register,       Address offset: 0x08      */
#define GPIO_PUPDR_OFFSET      0x000C    /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C      */
#define GPIO_IDR_OFFSET        0x0010    /*!< GPIO port input data register,         Address offset: 0x10      */
#define GPIO_ODR_OFFSET        0x0014    /*!< GPIO port output data register,        Address offset: 0x14      */
#define GPIO_BSRR_OFFSET       0x0018    /*!< GPIO port bit set/reset  register,     Address offset: 0x18      */
#define GPIO_LCKR_OFFSET       0x001C    /*!< GPIO port configuration lock register, Address offset: 0x1C      */
#define GPIO_AFR_OFFSET        0x0020    /*!< GPIO alternate function registers,     Address offset: 0x20-0x24 */
#define GPIO_BRR_OFFSET        0x0028    /*!< GPIO Bit Reset register,               Address offset: 0x28      */


/**
  * @brief Inter-integrated Circuit Interface
  */

#define I2C_CR1_OFFSET         0x0000    /*!< I2C Control register 1,            Address offset: 0x00 */
#define I2C_CR2_OFFSET         0x0004    /*!< I2C Control register 2,            Address offset: 0x04 */
#define I2C_OAR1_OFFSET        0x0008    /*!< I2C Own address 1 register,        Address offset: 0x08 */
#define I2C_OAR2_OFFSET        0x000C    /*!< I2C Own address 2 register,        Address offset: 0x0C */
#define I2C_TIMINGR_OFFSET     0x0010    /*!< I2C Timing register,               Address offset: 0x10 */
#define I2C_TIMEOUTR_OFFSET    0x0014    /*!< I2C Timeout register,              Address offset: 0x14 */
#define I2C_ISR_OFFSET         0x0018    /*!< I2C Interrupt and status register, Address offset: 0x18 */
#define I2C_ICR_OFFSET         0x001C    /*!< I2C Interrupt clear register,      Address offset: 0x1C */
#define I2C_PECR_OFFSET        0x0020    /*!< I2C PEC register,                  Address offset: 0x20 */
#define I2C_RXDR_OFFSET        0x0024    /*!< I2C Receive data register,         Address offset: 0x24 */
#define I2C_TXDR_OFFSET        0x0028    /*!< I2C Transmit data register,        Address offset: 0x28 */

/**
  * @brief Independent WATCHDOG
  */

#define IWDG_KR_OFFSET      0x0000    /*!< IWDG Key register,       Address offset: 0x00 */
#define IWDG_PR_OFFSET      0x0004    /*!< IWDG Prescaler register, Address offset: 0x04 */
#define IWDG_RLR_OFFSET     0x0008    /*!< IWDG Reload register,    Address offset: 0x08 */
#define IWDG_SR_OFFSET      0x000C    /*!< IWDG Status register,    Address offset: 0x0C */
#define IWDG_WINR_OFFSET    0x0010    /*!< IWDG Window register,    Address offset: 0x10 */

/**
  * @brief LPTIMER
  */
#define LPTIM_ISR_OFFSET     0x0000    /*!< LPTIM Interrupt and Status register,                Address offset: 0x00 */
#define LPTIM_ICR_OFFSET     0x0004    /*!< LPTIM Interrupt Clear register,                     Address offset: 0x04 */
#define LPTIM_IER_OFFSET     0x0008    /*!< LPTIM Interrupt Enable register,                    Address offset: 0x08 */
#define LPTIM_CFGR_OFFSET    0x000C    /*!< LPTIM Configuration register,                       Address offset: 0x0C */
#define LPTIM_CR_OFFSET      0x0010    /*!< LPTIM Control register,                             Address offset: 0x10 */
#define LPTIM_CMP_OFFSET     0x0014    /*!< LPTIM Compare register,                             Address offset: 0x14 */
#define LPTIM_ARR_OFFSET     0x0018    /*!< LPTIM Autoreload register,                          Address offset: 0x18 */
#define LPTIM_CNT_OFFSET     0x001C    /*!< LPTIM Counter register,                             Address offset: 0x1C */
#define LPTIM_OR_OFFSET      0x0020    /*!< LPTIM Option register,                              Address offset: 0x20 */

/**
  * @brief Operational Amplifier (OPAMP)
  */

#define OPAMP_CSR_OFFSET      0x0000    /*!< OPAMP control/status register,                     Address offset: 0x00 */
#define OPAMP_OTR_OFFSET      0x0004    /*!< OPAMP offset trimming register for normal mode,    Address offset: 0x04 */
#define OPAMP_LPOTR_OFFSET    0x0008    /*!< OPAMP offset trimming register for low power mode, Address offset: 0x08 */

#define OPAMP_Common_CSR_OFFSET    0x0000    /*!< OPAMP control/status register, used for bits common to several OPAMP instances, Address offset: 0x00 */

/**
  * @brief Power Control
  */

#define PWR_CR1_OFFSET          0x0000    /*!< PWR power control register 1,        Address offset: 0x00 */
#define PWR_CR2_OFFSET          0x0004    /*!< PWR power control register 2,        Address offset: 0x04 */
#define PWR_CR3_OFFSET          0x0008    /*!< PWR power control register 3,        Address offset: 0x08 */
#define PWR_CR4_OFFSET          0x000C    /*!< PWR power control register 4,        Address offset: 0x0C */
#define PWR_SR1_OFFSET          0x0010    /*!< PWR power status register 1,         Address offset: 0x10 */
#define PWR_SR2_OFFSET          0x0014    /*!< PWR power status register 2,         Address offset: 0x14 */
#define PWR_SCR_OFFSET          0x0018    /*!< PWR power status reset register,     Address offset: 0x18 */
#define PWR_RESERVED_OFFSET     0x001C    /*!< Reserved,                            Address offset: 0x1C */
#define PWR_PUCRA_OFFSET        0x0020    /*!< Pull_up control register of portA,   Address offset: 0x20 */
#define PWR_PDCRA_OFFSET        0x0024    /*!< Pull_Down control register of portA, Address offset: 0x24 */
#define PWR_PUCRB_OFFSET        0x0028    /*!< Pull_up control register of portB,   Address offset: 0x28 */
#define PWR_PDCRB_OFFSET        0x002C    /*!< Pull_Down control register of portB, Address offset: 0x2C */
#define PWR_PUCRC_OFFSET        0x0030    /*!< Pull_up control register of portC,   Address offset: 0x30 */
#define PWR_PDCRC_OFFSET        0x0034    /*!< Pull_Down control register of portC, Address offset: 0x34 */
#define PWR_PUCRD_OFFSET        0x0038    /*!< Pull_up control register of portD,   Address offset: 0x38 */
#define PWR_PDCRD_OFFSET        0x003C    /*!< Pull_Down control register of portD, Address offset: 0x3C */
#define PWR_PUCRE_OFFSET        0x0040    /*!< Pull_up control register of portE,   Address offset: 0x40 */
#define PWR_PDCRE_OFFSET        0x0044    /*!< Pull_Down control register of portE, Address offset: 0x44 */
#define PWR_RESERVED1_OFFSET    0x0048    /*!< Reserved,                            Address offset: 0x48 */
#define PWR_RESERVED2_OFFSET    0x004C    /*!< Reserved,                            Address offset: 0x4C */
#define PWR_RESERVED3_OFFSET    0x0050    /*!< Reserved,                            Address offset: 0x50 */
#define PWR_RESERVED4_OFFSET    0x0054    /*!< Reserved,                            Address offset: 0x54 */
#define PWR_PUCRH_OFFSET        0x0058    /*!< Pull_up control register of portH,   Address offset: 0x58 */
#define PWR_PDCRH_OFFSET        0x005C    /*!< Pull_Down control register of portH, Address offset: 0x5C */


/**
  * @brief QUAD Serial Peripheral Interface
  */

#define QUADSPI_CR_OFFSET       0x0000    /*!< QUADSPI Control register,                           Address offset: 0x00 */
#define QUADSPI_DCR_OFFSET      0x0004    /*!< QUADSPI Device Configuration register,              Address offset: 0x04 */
#define QUADSPI_SR_OFFSET       0x0008    /*!< QUADSPI Status register,                            Address offset: 0x08 */
#define QUADSPI_FCR_OFFSET      0x000C    /*!< QUADSPI Flag Clear register,                        Address offset: 0x0C */
#define QUADSPI_DLR_OFFSET      0x0010    /*!< QUADSPI Data Length register,                       Address offset: 0x10 */
#define QUADSPI_CCR_OFFSET      0x0014    /*!< QUADSPI Communication Configuration register,       Address offset: 0x14 */
#define QUADSPI_AR_OFFSET       0x0018    /*!< QUADSPI Address register,                           Address offset: 0x18 */
#define QUADSPI_ABR_OFFSET      0x001C    /*!< QUADSPI Alternate Bytes register,                   Address offset: 0x1C */
#define QUADSPI_DR_OFFSET       0x0020    /*!< QUADSPI Data register,                              Address offset: 0x20 */
#define QUADSPI_PSMKR_OFFSET    0x0024    /*!< QUADSPI Polling Status Mask register,               Address offset: 0x24 */
#define QUADSPI_PSMAR_OFFSET    0x0028    /*!< QUADSPI Polling Status Match register,              Address offset: 0x28 */
#define QUADSPI_PIR_OFFSET      0x002C    /*!< QUADSPI Polling Interval register,                  Address offset: 0x2C */
#define QUADSPI_LPTR_OFFSET     0x0030    /*!< QUADSPI Low Power Timeout register,                 Address offset: 0x30 */


/**
  * @brief Reset and Clock Control
  */

#define RCC_CR_OFFSET             0x0000    /*!< RCC clock control register,                                              Address offset: 0x00 */
#define RCC_ICSCR_OFFSET          0x0004    /*!< RCC internal clock sources calibration register,                         Address offset: 0x04 */
#define RCC_CFGR_OFFSET           0x0008    /*!< RCC clock configuration register,                                        Address offset: 0x08 */
#define RCC_PLLCFGR_OFFSET        0x000C    /*!< RCC system PLL configuration register,                                   Address offset: 0x0C */
#define RCC_PLLSAI1CFGR_OFFSET    0x0010    /*!< RCC PLL SAI1 configuration register,                                     Address offset: 0x10 */
#define RCC_RESERVED_OFFSET       0x0014    /*!< Reserved,                                                                Address offset: 0x14 */
#define RCC_CIER_OFFSET           0x0018    /*!< RCC clock interrupt enable register,                                     Address offset: 0x18 */
#define RCC_CIFR_OFFSET           0x001C    /*!< RCC clock interrupt flag register,                                       Address offset: 0x1C */
#define RCC_CICR_OFFSET           0x0020    /*!< RCC clock interrupt clear register,                                      Address offset: 0x20 */
#define RCC_RESERVED0_OFFSET      0x0024    /*!< Reserved,                                                                Address offset: 0x24 */
#define RCC_AHB1RSTR_OFFSET       0x0028    /*!< RCC AHB1 peripheral reset register,                                      Address offset: 0x28 */
#define RCC_AHB2RSTR_OFFSET       0x002C    /*!< RCC AHB2 peripheral reset register,                                      Address offset: 0x2C */
#define RCC_AHB3RSTR_OFFSET       0x0030    /*!< RCC AHB3 peripheral reset register,                                      Address offset: 0x30 */
#define RCC_RESERVED1_OFFSET      0x0034    /*!< Reserved,                                                                Address offset: 0x34 */
#define RCC_APB1RSTR1_OFFSET      0x0038    /*!< RCC APB1 peripheral reset register 1,                                    Address offset: 0x38 */
#define RCC_APB1RSTR2_OFFSET      0x003C    /*!< RCC APB1 peripheral reset register 2,                                    Address offset: 0x3C */
#define RCC_APB2RSTR_OFFSET       0x0040    /*!< RCC APB2 peripheral reset register,                                      Address offset: 0x40 */
#define RCC_RESERVED2_OFFSET      0x0044    /*!< Reserved,                                                                Address offset: 0x44 */
#define RCC_AHB1ENR_OFFSET        0x0048    /*!< RCC AHB1 peripheral clocks enable register,                              Address offset: 0x48 */
#define RCC_AHB2ENR_OFFSET        0x004C    /*!< RCC AHB2 peripheral clocks enable register,                              Address offset: 0x4C */
#define RCC_AHB3ENR_OFFSET        0x0050    /*!< RCC AHB3 peripheral clocks enable register,                              Address offset: 0x50 */
#define RCC_RESERVED3_OFFSET      0x0054    /*!< Reserved,                                                                Address offset: 0x54 */
#define RCC_APB1ENR1_OFFSET       0x0058    /*!< RCC APB1 peripheral clocks enable register 1,                            Address offset: 0x58 */
#define RCC_APB1ENR2_OFFSET       0x005C    /*!< RCC APB1 peripheral clocks enable register 2,                            Address offset: 0x5C */
#define RCC_APB2ENR_OFFSET        0x0060    /*!< RCC APB2 peripheral clocks enable register,                              Address offset: 0x60 */
#define RCC_RESERVED4_OFFSET      0x0064    /*!< Reserved,                                                                Address offset: 0x64 */
#define RCC_AHB1SMENR_OFFSET      0x0068    /*!< RCC AHB1 peripheral clocks enable in sleep and stop modes register,      Address offset: 0x68 */
#define RCC_AHB2SMENR_OFFSET      0x006C    /*!< RCC AHB2 peripheral clocks enable in sleep and stop modes register,      Address offset: 0x6C */
#define RCC_AHB3SMENR_OFFSET      0x0070    /*!< RCC AHB3 peripheral clocks enable in sleep and stop modes register,      Address offset: 0x70 */
#define RCC_RESERVED5_OFFSET      0x0074    /*!< Reserved,                                                                Address offset: 0x74 */
#define RCC_APB1SMENR1_OFFSET     0x0078    /*!< RCC APB1 peripheral clocks enable in sleep mode and stop modes register 1, Address offset: 0x78 */
#define RCC_APB1SMENR2_OFFSET     0x007C    /*!< RCC APB1 peripheral clocks enable in sleep mode and stop modes register 2, Address offset: 0x7C */
#define RCC_APB2SMENR_OFFSET      0x0080    /*!< RCC APB2 peripheral clocks enable in sleep mode and stop modes register, Address offset: 0x80 */
#define RCC_RESERVED6_OFFSET      0x0084    /*!< Reserved,                                                                Address offset: 0x84 */
#define RCC_CCIPR_OFFSET          0x0088    /*!< RCC peripherals independent clock configuration register,                Address offset: 0x88 */
#define RCC_RESERVED7_OFFSET      0x008C    /*!< Reserved,                                                                Address offset: 0x8C */
#define RCC_BDCR_OFFSET           0x0090    /*!< RCC backup domain control register,                                      Address offset: 0x90 */
#define RCC_CSR_OFFSET            0x0094    /*!< RCC clock control & status register,                                     Address offset: 0x94 */
#define RCC_CRRCR_OFFSET          0x0098    /*!< RCC clock recovery RC register,                                          Address offset: 0x98 */

/**
  * @brief Real-Time Clock
  */

