the-nw1-group/acb-modules/acb-common/include/stm/stm32l431xx.inc
#define RTC_TR_OFFSET          0x0000    /*!< RTC time register,                                         Address offset: 0x00 */
#define RTC_DR_OFFSET          0x0004    /*!< RTC date register,                                         Address offset: 0x04 */
#define RTC_CR_OFFSET          0x0008    /*!< RTC control register,                                      Address offset: 0x08 */
#define RTC_ISR_OFFSET         0x000C    /*!< RTC initialization and status register,                    Address offset: 0x0C */
#define RTC_PRER_OFFSET        0x0010    /*!< RTC prescaler register,                                    Address offset: 0x10 */
#define RTC_WUTR_OFFSET        0x0014    /*!< RTC wakeup timer register,                                 Address offset: 0x14 */
#define RTC_reserved_OFFSET    0x0018    /*!< Reserved  */
#define RTC_ALRMAR_OFFSET      0x001C    /*!< RTC alarm A register,                                      Address offset: 0x1C */
#define RTC_ALRMBR_OFFSET      0x0020    /*!< RTC alarm B register,                                      Address offset: 0x20 */
#define RTC_WPR_OFFSET         0x0024    /*!< RTC write protection register,                             Address offset: 0x24 */
#define RTC_SSR_OFFSET         0x0028    /*!< RTC sub second register,                                   Address offset: 0x28 */
#define RTC_SHIFTR_OFFSET      0x002C    /*!< RTC shift control register,                                Address offset: 0x2C */
#define RTC_TSTR_OFFSET        0x0030    /*!< RTC time stamp time register,                              Address offset: 0x30 */
#define RTC_TSDR_OFFSET        0x0034    /*!< RTC time stamp date register,                              Address offset: 0x34 */
#define RTC_TSSSR_OFFSET       0x0038    /*!< RTC time-stamp sub second register,                        Address offset: 0x38 */
#define RTC_CALR_OFFSET        0x003C    /*!< RTC calibration register,                                  Address offset: 0x3C */
#define RTC_TAMPCR_OFFSET      0x0040    /*!< RTC tamper configuration register,                         Address offset: 0x40 */
#define RTC_ALRMASSR_OFFSET    0x0044    /*!< RTC alarm A sub second register,                           Address offset: 0x44 */
#define RTC_ALRMBSSR_OFFSET    0x0048    /*!< RTC alarm B sub second register,                           Address offset: 0x48 */
#define RTC_OR_OFFSET          0x004C    /*!< RTC option register,                                       Address offset: 0x4C */
#define RTC_BKP0R_OFFSET       0x0050    /*!< RTC backup register 0,                                     Address offset: 0x50 */
#define RTC_BKP1R_OFFSET       0x0054    /*!< RTC backup register 1,                                     Address offset: 0x54 */
#define RTC_BKP2R_OFFSET       0x0058    /*!< RTC backup register 2,                                     Address offset: 0x58 */
#define RTC_BKP3R_OFFSET       0x005C    /*!< RTC backup register 3,                                     Address offset: 0x5C */
#define RTC_BKP4R_OFFSET       0x0060    /*!< RTC backup register 4,                                     Address offset: 0x60 */
#define RTC_BKP5R_OFFSET       0x0064    /*!< RTC backup register 5,                                     Address offset: 0x64 */
#define RTC_BKP6R_OFFSET       0x0068    /*!< RTC backup register 6,                                     Address offset: 0x68 */
#define RTC_BKP7R_OFFSET       0x006C    /*!< RTC backup register 7,                                     Address offset: 0x6C */
#define RTC_BKP8R_OFFSET       0x0070    /*!< RTC backup register 8,                                     Address offset: 0x70 */
#define RTC_BKP9R_OFFSET       0x0074    /*!< RTC backup register 9,                                     Address offset: 0x74 */
#define RTC_BKP10R_OFFSET      0x0078    /*!< RTC backup register 10,                                    Address offset: 0x78 */
#define RTC_BKP11R_OFFSET      0x007C    /*!< RTC backup register 11,                                    Address offset: 0x7C */
#define RTC_BKP12R_OFFSET      0x0080    /*!< RTC backup register 12,                                    Address offset: 0x80 */
#define RTC_BKP13R_OFFSET      0x0084    /*!< RTC backup register 13,                                    Address offset: 0x84 */
#define RTC_BKP14R_OFFSET      0x0088    /*!< RTC backup register 14,                                    Address offset: 0x88 */
#define RTC_BKP15R_OFFSET      0x008C    /*!< RTC backup register 15,                                    Address offset: 0x8C */
#define RTC_BKP16R_OFFSET      0x0090    /*!< RTC backup register 16,                                    Address offset: 0x90 */
#define RTC_BKP17R_OFFSET      0x0094    /*!< RTC backup register 17,                                    Address offset: 0x94 */
#define RTC_BKP18R_OFFSET      0x0098    /*!< RTC backup register 18,                                    Address offset: 0x98 */
#define RTC_BKP19R_OFFSET      0x009C    /*!< RTC backup register 19,                                    Address offset: 0x9C */
#define RTC_BKP20R_OFFSET      0x00A0    /*!< RTC backup register 20,                                    Address offset: 0xA0 */
#define RTC_BKP21R_OFFSET      0x00A4    /*!< RTC backup register 21,                                    Address offset: 0xA4 */
#define RTC_BKP22R_OFFSET      0x00A8    /*!< RTC backup register 22,                                    Address offset: 0xA8 */
#define RTC_BKP23R_OFFSET      0x00AC    /*!< RTC backup register 23,                                    Address offset: 0xAC */
#define RTC_BKP24R_OFFSET      0x00B0    /*!< RTC backup register 24,                                    Address offset: 0xB0 */
#define RTC_BKP25R_OFFSET      0x00B4    /*!< RTC backup register 25,                                    Address offset: 0xB4 */
#define RTC_BKP26R_OFFSET      0x00B8    /*!< RTC backup register 26,                                    Address offset: 0xB8 */
#define RTC_BKP27R_OFFSET      0x00BC    /*!< RTC backup register 27,                                    Address offset: 0xBC */
#define RTC_BKP28R_OFFSET      0x00C0    /*!< RTC backup register 28,                                    Address offset: 0xC0 */
#define RTC_BKP29R_OFFSET      0x00C4    /*!< RTC backup register 29,                                    Address offset: 0xC4 */
#define RTC_BKP30R_OFFSET      0x00C8    /*!< RTC backup register 30,                                    Address offset: 0xC8 */
#define RTC_BKP31R_OFFSET      0x00CC    /*!< RTC backup register 31,                                    Address offset: 0xCC */

/**
  * @brief Serial Audio Interface
  */

#define SAI_GCR_OFFSET    0x0000    /*!< SAI global configuration register,        Address offset: 0x00 */

#define SAI_Block_CR1_OFFSET      0x0000    /*!< SAI block x configuration register 1,     Address offset: 0x04 */
#define SAI_Block_CR2_OFFSET      0x0004    /*!< SAI block x configuration register 2,     Address offset: 0x08 */
#define SAI_Block_FRCR_OFFSET     0x0008    /*!< SAI block x frame configuration register, Address offset: 0x0C */
#define SAI_Block_SLOTR_OFFSET    0x000C    /*!< SAI block x slot register,                Address offset: 0x10 */
#define SAI_Block_IMR_OFFSET      0x0010    /*!< SAI block x interrupt mask register,      Address offset: 0x14 */
#define SAI_Block_SR_OFFSET       0x0014    /*!< SAI block x status register,              Address offset: 0x18 */
#define SAI_Block_CLRFR_OFFSET    0x0018    /*!< SAI block x clear flag register,          Address offset: 0x1C */
#define SAI_Block_DR_OFFSET       0x001C    /*!< SAI block x data register,                Address offset: 0x20 */


/**
  * @brief Secure digital input/output Interface
  */

#define SDMMC_POWER_OFFSET        0x0000    /*!< SDMMC power control register,    Address offset: 0x00 */
#define SDMMC_CLKCR_OFFSET        0x0004    /*!< SDMMC clock control register,    Address offset: 0x04 */
#define SDMMC_ARG_OFFSET          0x0008    /*!< SDMMC argument register,         Address offset: 0x08 */
#define SDMMC_CMD_OFFSET          0x000C    /*!< SDMMC command register,          Address offset: 0x0C */
#define SDMMC_RESPCMD_OFFSET      0x0010    /*!< SDMMC command response register, Address offset: 0x10 */
#define SDMMC_RESP1_OFFSET        0x0014    /*!< SDMMC response 1 register,       Address offset: 0x14 */
#define SDMMC_RESP2_OFFSET        0x0018    /*!< SDMMC response 2 register,       Address offset: 0x18 */
#define SDMMC_RESP3_OFFSET        0x001C    /*!< SDMMC response 3 register,       Address offset: 0x1C */
#define SDMMC_RESP4_OFFSET        0x0020    /*!< SDMMC response 4 register,       Address offset: 0x20 */
#define SDMMC_DTIMER_OFFSET       0x0024    /*!< SDMMC data timer register,       Address offset: 0x24 */
#define SDMMC_DLEN_OFFSET         0x0028    /*!< SDMMC data length register,      Address offset: 0x28 */
#define SDMMC_DCTRL_OFFSET        0x002C    /*!< SDMMC data control register,     Address offset: 0x2C */
#define SDMMC_DCOUNT_OFFSET       0x0030    /*!< SDMMC data counter register,     Address offset: 0x30 */
#define SDMMC_STA_OFFSET          0x0034    /*!< SDMMC status register,           Address offset: 0x34 */
#define SDMMC_ICR_OFFSET          0x0038    /*!< SDMMC interrupt clear register,  Address offset: 0x38 */
#define SDMMC_MASK_OFFSET         0x003C    /*!< SDMMC mask register,             Address offset: 0x3C */
#define SDMMC_RESERVED0_OFFSET    0x0040    /*!< Reserved, 0x40-0x44                                  */
#define SDMMC_FIFOCNT_OFFSET      0x0048    /*!< SDMMC FIFO counter register,     Address offset: 0x48 */
#define SDMMC_RESERVED1_OFFSET    0x004C    /*!< Reserved, 0x4C-0x7C                                  */
#define SDMMC_FIFO_OFFSET         0x0080    /*!< SDMMC data FIFO register,        Address offset: 0x80 */


/**
  * @brief Serial Peripheral Interface
  */

