the-nw1-group/acb-modules/acb-common/include/stm/stm32l431xx.inc
#define SPI_CR1_OFFSET       0x0000    /*!< SPI Control register 1,                              Address offset: 0x00 */
#define SPI_CR2_OFFSET       0x0004    /*!< SPI Control register 2,                              Address offset: 0x04 */
#define SPI_SR_OFFSET        0x0008    /*!< SPI Status register,                                 Address offset: 0x08 */
#define SPI_DR_OFFSET        0x000C    /*!< SPI data register,                                   Address offset: 0x0C */
#define SPI_CRCPR_OFFSET     0x0010    /*!< SPI CRC polynomial register,                         Address offset: 0x10 */
#define SPI_RXCRCR_OFFSET    0x0014    /*!< SPI Rx CRC register,                                 Address offset: 0x14 */
#define SPI_TXCRCR_OFFSET    0x0018    /*!< SPI Tx CRC register,                                 Address offset: 0x18 */


/**
  * @brief Single Wire Protocol Master Interface SPWMI
  */

#define SWPMI_CR_OFFSET           0x0000    /*!< SWPMI Configuration/Control register,     Address offset: 0x00 */
#define SWPMI_BRR_OFFSET          0x0004    /*!< SWPMI bitrate register,                   Address offset: 0x04 */
#define SWPMI_RESERVED1_OFFSET    0x0008    /*!< Reserved, 0x08                                                 */
#define SWPMI_ISR_OFFSET          0x000C    /*!< SWPMI Interrupt and Status register,      Address offset: 0x0C */
#define SWPMI_ICR_OFFSET          0x0010    /*!< SWPMI Interrupt Flag Clear register,      Address offset: 0x10 */
#define SWPMI_IER_OFFSET          0x0014    /*!< SWPMI Interrupt Enable register,          Address offset: 0x14 */
#define SWPMI_RFL_OFFSET          0x0018    /*!< SWPMI Receive Frame Length register,      Address offset: 0x18 */
#define SWPMI_TDR_OFFSET          0x001C    /*!< SWPMI Transmit data register,             Address offset: 0x1C */
#define SWPMI_RDR_OFFSET          0x0020    /*!< SWPMI Receive data register,              Address offset: 0x20 */
#define SWPMI_OR_OFFSET           0x0024    /*!< SWPMI Option register,                    Address offset: 0x24 */


/**
  * @brief System configuration controller
  */

#define SYSCFG_MEMRMP_OFFSET    0x0000    /*!< SYSCFG memory remap register,                      Address offset: 0x00      */
#define SYSCFG_CFGR1_OFFSET     0x0004    /*!< SYSCFG configuration register 1,                   Address offset: 0x04      */
#define SYSCFG_EXTICR_OFFSET    0x0008    /*!< SYSCFG external interrupt configuration registers, Address offset: 0x08-0x14 */
#define SYSCFG_SCSR_OFFSET      0x0018    /*!< SYSCFG SRAM2 control and status register,          Address offset: 0x18      */
#define SYSCFG_CFGR2_OFFSET     0x001C    /*!< SYSCFG configuration register 2,                   Address offset: 0x1C      */
#define SYSCFG_SWPR_OFFSET      0x0020    /*!< SYSCFG SRAM2 write protection register,            Address offset: 0x20      */
#define SYSCFG_SKR_OFFSET       0x0024    /*!< SYSCFG SRAM2 key register,                         Address offset: 0x24      */


/**
  * @brief TIM
  */

#define TIM_CR1_OFFSET      0x0000    /*!< TIM control register 1,                   Address offset: 0x00 */
#define TIM_CR2_OFFSET      0x0004    /*!< TIM control register 2,                   Address offset: 0x04 */
#define TIM_SMCR_OFFSET     0x0008    /*!< TIM slave mode control register,          Address offset: 0x08 */
#define TIM_DIER_OFFSET     0x000C    /*!< TIM DMA/interrupt enable register,        Address offset: 0x0C */
#define TIM_SR_OFFSET       0x0010    /*!< TIM status register,                      Address offset: 0x10 */
#define TIM_EGR_OFFSET      0x0014    /*!< TIM event generation register,            Address offset: 0x14 */
#define TIM_CCMR1_OFFSET    0x0018    /*!< TIM capture/compare mode register 1,      Address offset: 0x18 */
#define TIM_CCMR2_OFFSET    0x001C    /*!< TIM capture/compare mode register 2,      Address offset: 0x1C */
#define TIM_CCER_OFFSET     0x0020    /*!< TIM capture/compare enable register,      Address offset: 0x20 */
#define TIM_CNT_OFFSET      0x0024    /*!< TIM counter register,                     Address offset: 0x24 */
#define TIM_PSC_OFFSET      0x0028    /*!< TIM prescaler,                            Address offset: 0x28 */
#define TIM_ARR_OFFSET      0x002C    /*!< TIM auto-reload register,                 Address offset: 0x2C */
#define TIM_RCR_OFFSET      0x0030    /*!< TIM repetition counter register,          Address offset: 0x30 */
#define TIM_CCR1_OFFSET     0x0034    /*!< TIM capture/compare register 1,           Address offset: 0x34 */
#define TIM_CCR2_OFFSET     0x0038    /*!< TIM capture/compare register 2,           Address offset: 0x38 */
#define TIM_CCR3_OFFSET     0x003C    /*!< TIM capture/compare register 3,           Address offset: 0x3C */
#define TIM_CCR4_OFFSET     0x0040    /*!< TIM capture/compare register 4,           Address offset: 0x40 */
#define TIM_BDTR_OFFSET     0x0044    /*!< TIM break and dead-time register,         Address offset: 0x44 */
#define TIM_DCR_OFFSET      0x0048    /*!< TIM DMA control register,                 Address offset: 0x48 */
#define TIM_DMAR_OFFSET     0x004C    /*!< TIM DMA address for full transfer,        Address offset: 0x4C */
#define TIM_OR1_OFFSET      0x0050    /*!< TIM option register 1,                    Address offset: 0x50 */
#define TIM_CCMR3_OFFSET    0x0054    /*!< TIM capture/compare mode register 3,      Address offset: 0x54 */
#define TIM_CCR5_OFFSET     0x0058    /*!< TIM capture/compare register5,            Address offset: 0x58 */
#define TIM_CCR6_OFFSET     0x005C    /*!< TIM capture/compare register6,            Address offset: 0x5C */
#define TIM_OR2_OFFSET      0x0060    /*!< TIM option register 2,                    Address offset: 0x60 */
#define TIM_OR3_OFFSET      0x0064    /*!< TIM option register 3,                    Address offset: 0x64 */


/**
  * @brief Touch Sensing Controller (TSC)
  */

#define TSC_CR_OFFSET           0x0000    /*!< TSC control register,                                     Address offset: 0x00 */
#define TSC_IER_OFFSET          0x0004    /*!< TSC interrupt enable register,                            Address offset: 0x04 */
#define TSC_ICR_OFFSET          0x0008    /*!< TSC interrupt clear register,                             Address offset: 0x08 */
#define TSC_ISR_OFFSET          0x000C    /*!< TSC interrupt status register,                            Address offset: 0x0C */
#define TSC_IOHCR_OFFSET        0x0010    /*!< TSC I/O hysteresis control register,                      Address offset: 0x10 */
#define TSC_RESERVED1_OFFSET    0x0014    /*!< Reserved,                                                 Address offset: 0x14 */
#define TSC_IOASCR_OFFSET       0x0018    /*!< TSC I/O analog switch control register,                   Address offset: 0x18 */
#define TSC_RESERVED2_OFFSET    0x001C    /*!< Reserved,                                                 Address offset: 0x1C */
#define TSC_IOSCR_OFFSET        0x0020    /*!< TSC I/O sampling control register,                        Address offset: 0x20 */
#define TSC_RESERVED3_OFFSET    0x0024    /*!< Reserved,                                                 Address offset: 0x24 */
#define TSC_IOCCR_OFFSET        0x0028    /*!< TSC I/O channel control register,                         Address offset: 0x28 */
#define TSC_RESERVED4_OFFSET    0x002C    /*!< Reserved,                                                 Address offset: 0x2C */
#define TSC_IOGCSR_OFFSET       0x0030    /*!< TSC I/O group control status register,                    Address offset: 0x30 */
#define TSC_IOGXCR_OFFSET       0x0034    /*!< TSC I/O group x counter register,                         Address offset: 0x34-4C */

/**
  * @brief Universal Synchronous Asynchronous Receiver Transmitter
  */

#define USART_CR1_OFFSET          0x0000    /*!< USART Control register 1,                 Address offset: 0x00 */
#define USART_CR2_OFFSET          0x0004    /*!< USART Control register 2,                 Address offset: 0x04 */
#define USART_CR3_OFFSET          0x0008    /*!< USART Control register 3,                 Address offset: 0x08 */
#define USART_BRR_OFFSET          0x000C    /*!< USART Baud rate register,                 Address offset: 0x0C */
#define USART_GTPR_OFFSET         0x0010    /*!< USART Guard time and prescaler register,  Address offset: 0x10 */
#define USART_RESERVED2_OFFSET    0x0012    /*!< Reserved, 0x12                                                 */
#define USART_RTOR_OFFSET         0x0014    /*!< USART Receiver Time Out register,         Address offset: 0x14 */
#define USART_RQR_OFFSET          0x0018    /*!< USART Request register,                   Address offset: 0x18 */
#define USART_RESERVED3_OFFSET    0x001A    /*!< Reserved, 0x1A                                                 */
#define USART_ISR_OFFSET          0x001C    /*!< USART Interrupt and status register,      Address offset: 0x1C */
#define USART_ICR_OFFSET          0x0020    /*!< USART Interrupt flag Clear register,      Address offset: 0x20 */
#define USART_RDR_OFFSET          0x0024    /*!< USART Receive Data register,              Address offset: 0x24 */
#define USART_RESERVED4_OFFSET    0x0026    /*!< Reserved, 0x26                                                 */
#define USART_TDR_OFFSET          0x0028    /*!< USART Transmit Data register,             Address offset: 0x28 */
#define USART_RESERVED5_OFFSET    0x002A    /*!< Reserved, 0x2A                                                 */

/**
  * @brief VREFBUF
  */

