the-nw1-group/acb-modules/acb-common/include/stm/stm32l431xx.inc
#define GPIOA_BASE            (AHB2PERIPH_BASE + 0x0000UL)
#define GPIOB_BASE            (AHB2PERIPH_BASE + 0x0400UL)
#define GPIOC_BASE            (AHB2PERIPH_BASE + 0x0800UL)
#define GPIOD_BASE            (AHB2PERIPH_BASE + 0x0C00UL)
#define GPIOE_BASE            (AHB2PERIPH_BASE + 0x1000UL)
#define GPIOH_BASE            (AHB2PERIPH_BASE + 0x1C00UL)


#define ADC1_BASE             (AHB2PERIPH_BASE + 0x08040000UL)
#define ADC1_COMMON_BASE      (AHB2PERIPH_BASE + 0x08040300UL)


#define RNG_BASE              (AHB2PERIPH_BASE + 0x08060800UL)



#define DBGMCU_BASE           (0xE0042000UL)


#define PACKAGE_BASE          (0x1FFF7500UL)        /*!< Package data register base address     */
#define UID_BASE              (0x1FFF7590UL)        /*!< Unique device ID register base address */
#define FLASHSIZE_BASE        (0x1FFF75E0UL)        /*!< Flash size data register base address  */
/**
  * @}
  */

/** @addtogroup Peripheral_declaration
  * @{
  */
#define TIM2                (TIM2_BASE)
#define _TIM2_CR1      (TIM2 + TIM_CR1_OFFSET)      /*!< TIM control register 1,                   Address offset: 0x00 */
#define _TIM2_CR2      (TIM2 + TIM_CR2_OFFSET)      /*!< TIM control register 2,                   Address offset: 0x04 */
#define _TIM2_SMCR     (TIM2 + TIM_SMCR_OFFSET)     /*!< TIM slave mode control register,          Address offset: 0x08 */
#define _TIM2_DIER     (TIM2 + TIM_DIER_OFFSET)     /*!< TIM DMA/interrupt enable register,        Address offset: 0x0C */
#define _TIM2_SR       (TIM2 + TIM_SR_OFFSET)       /*!< TIM status register,                      Address offset: 0x10 */
#define _TIM2_EGR      (TIM2 + TIM_EGR_OFFSET)      /*!< TIM event generation register,            Address offset: 0x14 */
#define _TIM2_CCMR1    (TIM2 + TIM_CCMR1_OFFSET)    /*!< TIM capture/compare mode register 1,      Address offset: 0x18 */
#define _TIM2_CCMR2    (TIM2 + TIM_CCMR2_OFFSET)    /*!< TIM capture/compare mode register 2,      Address offset: 0x1C */
#define _TIM2_CCER     (TIM2 + TIM_CCER_OFFSET)     /*!< TIM capture/compare enable register,      Address offset: 0x20 */
#define _TIM2_CNT      (TIM2 + TIM_CNT_OFFSET)      /*!< TIM counter register,                     Address offset: 0x24 */
#define _TIM2_PSC      (TIM2 + TIM_PSC_OFFSET)      /*!< TIM prescaler,                            Address offset: 0x28 */
#define _TIM2_ARR      (TIM2 + TIM_ARR_OFFSET)      /*!< TIM auto-reload register,                 Address offset: 0x2C */
#define _TIM2_RCR      (TIM2 + TIM_RCR_OFFSET)      /*!< TIM repetition counter register,          Address offset: 0x30 */
#define _TIM2_CCR1     (TIM2 + TIM_CCR1_OFFSET)     /*!< TIM capture/compare register 1,           Address offset: 0x34 */
#define _TIM2_CCR2     (TIM2 + TIM_CCR2_OFFSET)     /*!< TIM capture/compare register 2,           Address offset: 0x38 */
#define _TIM2_CCR3     (TIM2 + TIM_CCR3_OFFSET)     /*!< TIM capture/compare register 3,           Address offset: 0x3C */
#define _TIM2_CCR4     (TIM2 + TIM_CCR4_OFFSET)     /*!< TIM capture/compare register 4,           Address offset: 0x40 */
#define _TIM2_BDTR     (TIM2 + TIM_BDTR_OFFSET)     /*!< TIM break and dead-time register,         Address offset: 0x44 */
#define _TIM2_DCR      (TIM2 + TIM_DCR_OFFSET)      /*!< TIM DMA control register,                 Address offset: 0x48 */
#define _TIM2_DMAR     (TIM2 + TIM_DMAR_OFFSET)     /*!< TIM DMA address for full transfer,        Address offset: 0x4C */
#define _TIM2_OR1      (TIM2 + TIM_OR1_OFFSET)      /*!< TIM option register 1,                    Address offset: 0x50 */
#define _TIM2_CCMR3    (TIM2 + TIM_CCMR3_OFFSET)    /*!< TIM capture/compare mode register 3,      Address offset: 0x54 */
#define _TIM2_CCR5     (TIM2 + TIM_CCR5_OFFSET)     /*!< TIM capture/compare register5,            Address offset: 0x58 */
#define _TIM2_CCR6     (TIM2 + TIM_CCR6_OFFSET)     /*!< TIM capture/compare register6,            Address offset: 0x5C */
#define _TIM2_OR2      (TIM2 + TIM_OR2_OFFSET)      /*!< TIM option register 2,                    Address offset: 0x60 */
#define _TIM2_OR3      (TIM2 + TIM_OR3_OFFSET)      /*!< TIM option register 3,                    Address offset: 0x64 */

#define TIM6                (TIM6_BASE)
#define _TIM6_CR1      (TIM6 + TIM_CR1_OFFSET)      /*!< TIM control register 1,                   Address offset: 0x00 */
#define _TIM6_CR2      (TIM6 + TIM_CR2_OFFSET)      /*!< TIM control register 2,                   Address offset: 0x04 */
#define _TIM6_SMCR     (TIM6 + TIM_SMCR_OFFSET)     /*!< TIM slave mode control register,          Address offset: 0x08 */
#define _TIM6_DIER     (TIM6 + TIM_DIER_OFFSET)     /*!< TIM DMA/interrupt enable register,        Address offset: 0x0C */
#define _TIM6_SR       (TIM6 + TIM_SR_OFFSET)       /*!< TIM status register,                      Address offset: 0x10 */
#define _TIM6_EGR      (TIM6 + TIM_EGR_OFFSET)      /*!< TIM event generation register,            Address offset: 0x14 */
#define _TIM6_CCMR1    (TIM6 + TIM_CCMR1_OFFSET)    /*!< TIM capture/compare mode register 1,      Address offset: 0x18 */
#define _TIM6_CCMR2    (TIM6 + TIM_CCMR2_OFFSET)    /*!< TIM capture/compare mode register 2,      Address offset: 0x1C */
#define _TIM6_CCER     (TIM6 + TIM_CCER_OFFSET)     /*!< TIM capture/compare enable register,      Address offset: 0x20 */
#define _TIM6_CNT      (TIM6 + TIM_CNT_OFFSET)      /*!< TIM counter register,                     Address offset: 0x24 */
#define _TIM6_PSC      (TIM6 + TIM_PSC_OFFSET)      /*!< TIM prescaler,                            Address offset: 0x28 */
#define _TIM6_ARR      (TIM6 + TIM_ARR_OFFSET)      /*!< TIM auto-reload register,                 Address offset: 0x2C */
#define _TIM6_RCR      (TIM6 + TIM_RCR_OFFSET)      /*!< TIM repetition counter register,          Address offset: 0x30 */
#define _TIM6_CCR1     (TIM6 + TIM_CCR1_OFFSET)     /*!< TIM capture/compare register 1,           Address offset: 0x34 */
#define _TIM6_CCR2     (TIM6 + TIM_CCR2_OFFSET)     /*!< TIM capture/compare register 2,           Address offset: 0x38 */
#define _TIM6_CCR3     (TIM6 + TIM_CCR3_OFFSET)     /*!< TIM capture/compare register 3,           Address offset: 0x3C */
#define _TIM6_CCR4     (TIM6 + TIM_CCR4_OFFSET)     /*!< TIM capture/compare register 4,           Address offset: 0x40 */
#define _TIM6_BDTR     (TIM6 + TIM_BDTR_OFFSET)     /*!< TIM break and dead-time register,         Address offset: 0x44 */
#define _TIM6_DCR      (TIM6 + TIM_DCR_OFFSET)      /*!< TIM DMA control register,                 Address offset: 0x48 */
#define _TIM6_DMAR     (TIM6 + TIM_DMAR_OFFSET)     /*!< TIM DMA address for full transfer,        Address offset: 0x4C */
#define _TIM6_OR1      (TIM6 + TIM_OR1_OFFSET)      /*!< TIM option register 1,                    Address offset: 0x50 */
#define _TIM6_CCMR3    (TIM6 + TIM_CCMR3_OFFSET)    /*!< TIM capture/compare mode register 3,      Address offset: 0x54 */
#define _TIM6_CCR5     (TIM6 + TIM_CCR5_OFFSET)     /*!< TIM capture/compare register5,            Address offset: 0x58 */
#define _TIM6_CCR6     (TIM6 + TIM_CCR6_OFFSET)     /*!< TIM capture/compare register6,            Address offset: 0x5C */
#define _TIM6_OR2      (TIM6 + TIM_OR2_OFFSET)      /*!< TIM option register 2,                    Address offset: 0x60 */
#define _TIM6_OR3      (TIM6 + TIM_OR3_OFFSET)      /*!< TIM option register 3,                    Address offset: 0x64 */

#define TIM7                (TIM7_BASE)
#define _TIM7_CR1      (TIM7 + TIM_CR1_OFFSET)      /*!< TIM control register 1,                   Address offset: 0x00 */
#define _TIM7_CR2      (TIM7 + TIM_CR2_OFFSET)      /*!< TIM control register 2,                   Address offset: 0x04 */
#define _TIM7_SMCR     (TIM7 + TIM_SMCR_OFFSET)     /*!< TIM slave mode control register,          Address offset: 0x08 */
#define _TIM7_DIER     (TIM7 + TIM_DIER_OFFSET)     /*!< TIM DMA/interrupt enable register,        Address offset: 0x0C */
#define _TIM7_SR       (TIM7 + TIM_SR_OFFSET)       /*!< TIM status register,                      Address offset: 0x10 */
#define _TIM7_EGR      (TIM7 + TIM_EGR_OFFSET)      /*!< TIM event generation register,            Address offset: 0x14 */
#define _TIM7_CCMR1    (TIM7 + TIM_CCMR1_OFFSET)    /*!< TIM capture/compare mode register 1,      Address offset: 0x18 */
#define _TIM7_CCMR2    (TIM7 + TIM_CCMR2_OFFSET)    /*!< TIM capture/compare mode register 2,      Address offset: 0x1C */
#define _TIM7_CCER     (TIM7 + TIM_CCER_OFFSET)     /*!< TIM capture/compare enable register,      Address offset: 0x20 */
#define _TIM7_CNT      (TIM7 + TIM_CNT_OFFSET)      /*!< TIM counter register,                     Address offset: 0x24 */
#define _TIM7_PSC      (TIM7 + TIM_PSC_OFFSET)      /*!< TIM prescaler,                            Address offset: 0x28 */
#define _TIM7_ARR      (TIM7 + TIM_ARR_OFFSET)      /*!< TIM auto-reload register,                 Address offset: 0x2C */
#define _TIM7_RCR      (TIM7 + TIM_RCR_OFFSET)      /*!< TIM repetition counter register,          Address offset: 0x30 */
#define _TIM7_CCR1     (TIM7 + TIM_CCR1_OFFSET)     /*!< TIM capture/compare register 1,           Address offset: 0x34 */
#define _TIM7_CCR2     (TIM7 + TIM_CCR2_OFFSET)     /*!< TIM capture/compare register 2,           Address offset: 0x38 */
#define _TIM7_CCR3     (TIM7 + TIM_CCR3_OFFSET)     /*!< TIM capture/compare register 3,           Address offset: 0x3C */
#define _TIM7_CCR4     (TIM7 + TIM_CCR4_OFFSET)     /*!< TIM capture/compare register 4,           Address offset: 0x40 */
#define _TIM7_BDTR     (TIM7 + TIM_BDTR_OFFSET)     /*!< TIM break and dead-time register,         Address offset: 0x44 */
#define _TIM7_DCR      (TIM7 + TIM_DCR_OFFSET)      /*!< TIM DMA control register,                 Address offset: 0x48 */
#define _TIM7_DMAR     (TIM7 + TIM_DMAR_OFFSET)     /*!< TIM DMA address for full transfer,        Address offset: 0x4C */
#define _TIM7_OR1      (TIM7 + TIM_OR1_OFFSET)      /*!< TIM option register 1,                    Address offset: 0x50 */
#define _TIM7_CCMR3    (TIM7 + TIM_CCMR3_OFFSET)    /*!< TIM capture/compare mode register 3,      Address offset: 0x54 */
#define _TIM7_CCR5     (TIM7 + TIM_CCR5_OFFSET)     /*!< TIM capture/compare register5,            Address offset: 0x58 */
#define _TIM7_CCR6     (TIM7 + TIM_CCR6_OFFSET)     /*!< TIM capture/compare register6,            Address offset: 0x5C */
#define _TIM7_OR2      (TIM7 + TIM_OR2_OFFSET)      /*!< TIM option register 2,                    Address offset: 0x60 */
#define _TIM7_OR3      (TIM7 + TIM_OR3_OFFSET)      /*!< TIM option register 3,                    Address offset: 0x64 */

#define RTC                 (RTC_BASE)
#define _RTC_TR          (RTC + RTC_TR_OFFSET)          /*!< RTC time register,                                         Address offset: 0x00 */
#define _RTC_DR          (RTC + RTC_DR_OFFSET)          /*!< RTC date register,                                         Address offset: 0x04 */
#define _RTC_CR          (RTC + RTC_CR_OFFSET)          /*!< RTC control register,                                      Address offset: 0x08 */
#define _RTC_ISR         (RTC + RTC_ISR_OFFSET)         /*!< RTC initialization and status register,                    Address offset: 0x0C */
#define _RTC_PRER        (RTC + RTC_PRER_OFFSET)        /*!< RTC prescaler register,                                    Address offset: 0x10 */
#define _RTC_WUTR        (RTC + RTC_WUTR_OFFSET)        /*!< RTC wakeup timer register,                                 Address offset: 0x14 */
#define _RTC_reserved    (RTC + RTC_reserved_OFFSET)    /*!< Reserved  */
#define _RTC_ALRMAR      (RTC + RTC_ALRMAR_OFFSET)      /*!< RTC alarm A register,                                      Address offset: 0x1C */
#define _RTC_ALRMBR      (RTC + RTC_ALRMBR_OFFSET)      /*!< RTC alarm B register,                                      Address offset: 0x20 */
#define _RTC_WPR         (RTC + RTC_WPR_OFFSET)         /*!< RTC write protection register,                             Address offset: 0x24 */
#define _RTC_SSR         (RTC + RTC_SSR_OFFSET)         /*!< RTC sub second register,                                   Address offset: 0x28 */
#define _RTC_SHIFTR      (RTC + RTC_SHIFTR_OFFSET)      /*!< RTC shift control register,                                Address offset: 0x2C */
#define _RTC_TSTR        (RTC + RTC_TSTR_OFFSET)        /*!< RTC time stamp time register,                              Address offset: 0x30 */
#define _RTC_TSDR        (RTC + RTC_TSDR_OFFSET)        /*!< RTC time stamp date register,                              Address offset: 0x34 */
#define _RTC_TSSSR       (RTC + RTC_TSSSR_OFFSET)       /*!< RTC time-stamp sub second register,                        Address offset: 0x38 */
#define _RTC_CALR        (RTC + RTC_CALR_OFFSET)        /*!< RTC calibration register,                                  Address offset: 0x3C */
#define _RTC_TAMPCR      (RTC + RTC_TAMPCR_OFFSET)      /*!< RTC tamper configuration register,                         Address offset: 0x40 */
#define _RTC_ALRMASSR    (RTC + RTC_ALRMASSR_OFFSET)    /*!< RTC alarm A sub second register,                           Address offset: 0x44 */
#define _RTC_ALRMBSSR    (RTC + RTC_ALRMBSSR_OFFSET)    /*!< RTC alarm B sub second register,                           Address offset: 0x48 */
#define _RTC_OR          (RTC + RTC_OR_OFFSET)          /*!< RTC option register,                                       Address offset: 0x4C */
#define _RTC_BKP0R       (RTC + RTC_BKP0R_OFFSET)       /*!< RTC backup register 0,                                     Address offset: 0x50 */
#define _RTC_BKP1R       (RTC + RTC_BKP1R_OFFSET)       /*!< RTC backup register 1,                                     Address offset: 0x54 */
#define _RTC_BKP2R       (RTC + RTC_BKP2R_OFFSET)       /*!< RTC backup register 2,                                     Address offset: 0x58 */
#define _RTC_BKP3R       (RTC + RTC_BKP3R_OFFSET)       /*!< RTC backup register 3,                                     Address offset: 0x5C */
#define _RTC_BKP4R       (RTC + RTC_BKP4R_OFFSET)       /*!< RTC backup register 4,                                     Address offset: 0x60 */
#define _RTC_BKP5R       (RTC + RTC_BKP5R_OFFSET)       /*!< RTC backup register 5,                                     Address offset: 0x64 */
#define _RTC_BKP6R       (RTC + RTC_BKP6R_OFFSET)       /*!< RTC backup register 6,                                     Address offset: 0x68 */
#define _RTC_BKP7R       (RTC + RTC_BKP7R_OFFSET)       /*!< RTC backup register 7,                                     Address offset: 0x6C */
#define _RTC_BKP8R       (RTC + RTC_BKP8R_OFFSET)       /*!< RTC backup register 8,                                     Address offset: 0x70 */
#define _RTC_BKP9R       (RTC + RTC_BKP9R_OFFSET)       /*!< RTC backup register 9,                                     Address offset: 0x74 */
#define _RTC_BKP10R      (RTC + RTC_BKP10R_OFFSET)      /*!< RTC backup register 10,                                    Address offset: 0x78 */
#define _RTC_BKP11R      (RTC + RTC_BKP11R_OFFSET)      /*!< RTC backup register 11,                                    Address offset: 0x7C */
#define _RTC_BKP12R      (RTC + RTC_BKP12R_OFFSET)      /*!< RTC backup register 12,                                    Address offset: 0x80 */
#define _RTC_BKP13R      (RTC + RTC_BKP13R_OFFSET)      /*!< RTC backup register 13,                                    Address offset: 0x84 */
#define _RTC_BKP14R      (RTC + RTC_BKP14R_OFFSET)      /*!< RTC backup register 14,                                    Address offset: 0x88 */
#define _RTC_BKP15R      (RTC + RTC_BKP15R_OFFSET)      /*!< RTC backup register 15,                                    Address offset: 0x8C */
#define _RTC_BKP16R      (RTC + RTC_BKP16R_OFFSET)      /*!< RTC backup register 16,                                    Address offset: 0x90 */
#define _RTC_BKP17R      (RTC + RTC_BKP17R_OFFSET)      /*!< RTC backup register 17,                                    Address offset: 0x94 */
#define _RTC_BKP18R      (RTC + RTC_BKP18R_OFFSET)      /*!< RTC backup register 18,                                    Address offset: 0x98 */
#define _RTC_BKP19R      (RTC + RTC_BKP19R_OFFSET)      /*!< RTC backup register 19,                                    Address offset: 0x9C */
#define _RTC_BKP20R      (RTC + RTC_BKP20R_OFFSET)      /*!< RTC backup register 20,                                    Address offset: 0xA0 */
#define _RTC_BKP21R      (RTC + RTC_BKP21R_OFFSET)      /*!< RTC backup register 21,                                    Address offset: 0xA4 */
#define _RTC_BKP22R      (RTC + RTC_BKP22R_OFFSET)      /*!< RTC backup register 22,                                    Address offset: 0xA8 */
#define _RTC_BKP23R      (RTC + RTC_BKP23R_OFFSET)      /*!< RTC backup register 23,                                    Address offset: 0xAC */
#define _RTC_BKP24R      (RTC + RTC_BKP24R_OFFSET)      /*!< RTC backup register 24,                                    Address offset: 0xB0 */
#define _RTC_BKP25R      (RTC + RTC_BKP25R_OFFSET)      /*!< RTC backup register 25,                                    Address offset: 0xB4 */
#define _RTC_BKP26R      (RTC + RTC_BKP26R_OFFSET)      /*!< RTC backup register 26,                                    Address offset: 0xB8 */
#define _RTC_BKP27R      (RTC + RTC_BKP27R_OFFSET)      /*!< RTC backup register 27,                                    Address offset: 0xBC */
#define _RTC_BKP28R      (RTC + RTC_BKP28R_OFFSET)      /*!< RTC backup register 28,                                    Address offset: 0xC0 */
#define _RTC_BKP29R      (RTC + RTC_BKP29R_OFFSET)      /*!< RTC backup register 29,                                    Address offset: 0xC4 */
#define _RTC_BKP30R      (RTC + RTC_BKP30R_OFFSET)      /*!< RTC backup register 30,                                    Address offset: 0xC8 */
#define _RTC_BKP31R      (RTC + RTC_BKP31R_OFFSET)      /*!< RTC backup register 31,                                    Address offset: 0xCC */

#define WWDG                (WWDG_BASE)
#define _WWDG_CR     (WWDG + WWDG_CR_OFFSET)     /*!< WWDG Control register,       Address offset: 0x00 */
#define _WWDG_CFR    (WWDG + WWDG_CFR_OFFSET)    /*!< WWDG Configuration register, Address offset: 0x04 */
#define _WWDG_SR     (WWDG + WWDG_SR_OFFSET)     /*!< WWDG Status register,        Address offset: 0x08 */

#define IWDG                (IWDG_BASE)
#define _IWDG_KR      (IWDG + IWDG_KR_OFFSET)      /*!< IWDG Key register,       Address offset: 0x00 */
#define _IWDG_PR      (IWDG + IWDG_PR_OFFSET)      /*!< IWDG Prescaler register, Address offset: 0x04 */
#define _IWDG_RLR     (IWDG + IWDG_RLR_OFFSET)     /*!< IWDG Reload register,    Address offset: 0x08 */
#define _IWDG_SR      (IWDG + IWDG_SR_OFFSET)      /*!< IWDG Status register,    Address offset: 0x0C */
#define _IWDG_WINR    (IWDG + IWDG_WINR_OFFSET)    /*!< IWDG Window register,    Address offset: 0x10 */

#define SPI2                (SPI2_BASE)
#define _SPI2_CR1       (SPI2 + SPI_CR1_OFFSET)       /*!< SPI Control register 1,                              Address offset: 0x00 */
#define _SPI2_CR2       (SPI2 + SPI_CR2_OFFSET)       /*!< SPI Control register 2,                              Address offset: 0x04 */
#define _SPI2_SR        (SPI2 + SPI_SR_OFFSET)        /*!< SPI Status register,                                 Address offset: 0x08 */
#define _SPI2_DR        (SPI2 + SPI_DR_OFFSET)        /*!< SPI data register,                                   Address offset: 0x0C */
#define _SPI2_CRCPR     (SPI2 + SPI_CRCPR_OFFSET)     /*!< SPI CRC polynomial register,                         Address offset: 0x10 */
#define _SPI2_RXCRCR    (SPI2 + SPI_RXCRCR_OFFSET)    /*!< SPI Rx CRC register,                                 Address offset: 0x14 */
#define _SPI2_TXCRCR    (SPI2 + SPI_TXCRCR_OFFSET)    /*!< SPI Tx CRC register,                                 Address offset: 0x18 */

#define SPI3                (SPI3_BASE)
#define _SPI3_CR1       (SPI3 + SPI_CR1_OFFSET)       /*!< SPI Control register 1,                              Address offset: 0x00 */
#define _SPI3_CR2       (SPI3 + SPI_CR2_OFFSET)       /*!< SPI Control register 2,                              Address offset: 0x04 */
#define _SPI3_SR        (SPI3 + SPI_SR_OFFSET)        /*!< SPI Status register,                                 Address offset: 0x08 */
#define _SPI3_DR        (SPI3 + SPI_DR_OFFSET)        /*!< SPI data register,                                   Address offset: 0x0C */
#define _SPI3_CRCPR     (SPI3 + SPI_CRCPR_OFFSET)     /*!< SPI CRC polynomial register,                         Address offset: 0x10 */
#define _SPI3_RXCRCR    (SPI3 + SPI_RXCRCR_OFFSET)    /*!< SPI Rx CRC register,                                 Address offset: 0x14 */
#define _SPI3_TXCRCR    (SPI3 + SPI_TXCRCR_OFFSET)    /*!< SPI Tx CRC register,                                 Address offset: 0x18 */

