the-nw1-group/acb-modules/acb-common/include/stm/stm32l431xx.inc
#define USART2              (USART2_BASE)
#define _USART2_CR1          (USART2 + USART_CR1_OFFSET)          /*!< USART Control register 1,                 Address offset: 0x00 */
#define _USART2_CR2          (USART2 + USART_CR2_OFFSET)          /*!< USART Control register 2,                 Address offset: 0x04 */
#define _USART2_CR3          (USART2 + USART_CR3_OFFSET)          /*!< USART Control register 3,                 Address offset: 0x08 */
#define _USART2_BRR          (USART2 + USART_BRR_OFFSET)          /*!< USART Baud rate register,                 Address offset: 0x0C */
#define _USART2_GTPR         (USART2 + USART_GTPR_OFFSET)         /*!< USART Guard time and prescaler register,  Address offset: 0x10 */
#define _USART2_RTOR         (USART2 + USART_RTOR_OFFSET)         /*!< USART Receiver Time Out register,         Address offset: 0x14 */
#define _USART2_RQR          (USART2 + USART_RQR_OFFSET)          /*!< USART Request register,                   Address offset: 0x18 */
#define _USART2_ISR          (USART2 + USART_ISR_OFFSET)          /*!< USART Interrupt and status register,      Address offset: 0x1C */
#define _USART2_ICR          (USART2 + USART_ICR_OFFSET)          /*!< USART Interrupt flag Clear register,      Address offset: 0x20 */
#define _USART2_RDR          (USART2 + USART_RDR_OFFSET)          /*!< USART Receive Data register,              Address offset: 0x24 */
#define _USART2_TDR          (USART2 + USART_TDR_OFFSET)          /*!< USART Transmit Data register,             Address offset: 0x28 */

#define USART3              (USART3_BASE)
#define _USART3_CR1          (USART3 + USART_CR1_OFFSET)          /*!< USART Control register 1,                 Address offset: 0x00 */
#define _USART3_CR2          (USART3 + USART_CR2_OFFSET)          /*!< USART Control register 2,                 Address offset: 0x04 */
#define _USART3_CR3          (USART3 + USART_CR3_OFFSET)          /*!< USART Control register 3,                 Address offset: 0x08 */
#define _USART3_BRR          (USART3 + USART_BRR_OFFSET)          /*!< USART Baud rate register,                 Address offset: 0x0C */
#define _USART3_GTPR         (USART3 + USART_GTPR_OFFSET)         /*!< USART Guard time and prescaler register,  Address offset: 0x10 */
#define _USART3_RTOR         (USART3 + USART_RTOR_OFFSET)         /*!< USART Receiver Time Out register,         Address offset: 0x14 */
#define _USART3_RQR          (USART3 + USART_RQR_OFFSET)          /*!< USART Request register,                   Address offset: 0x18 */
#define _USART3_ISR          (USART3 + USART_ISR_OFFSET)          /*!< USART Interrupt and status register,      Address offset: 0x1C */
#define _USART3_ICR          (USART3 + USART_ICR_OFFSET)          /*!< USART Interrupt flag Clear register,      Address offset: 0x20 */
#define _USART3_RDR          (USART3 + USART_RDR_OFFSET)          /*!< USART Receive Data register,              Address offset: 0x24 */
#define _USART3_TDR          (USART3 + USART_TDR_OFFSET)          /*!< USART Transmit Data register,             Address offset: 0x28 */

#define I2C1                (I2C1_BASE)
#define _I2C1_CR1         (I2C1 + I2C_CR1_OFFSET)         /*!< I2C Control register 1,            Address offset: 0x00 */
#define _I2C1_CR2         (I2C1 + I2C_CR2_OFFSET)         /*!< I2C Control register 2,            Address offset: 0x04 */
#define _I2C1_OAR1        (I2C1 + I2C_OAR1_OFFSET)        /*!< I2C Own address 1 register,        Address offset: 0x08 */
#define _I2C1_OAR2        (I2C1 + I2C_OAR2_OFFSET)        /*!< I2C Own address 2 register,        Address offset: 0x0C */
#define _I2C1_TIMINGR     (I2C1 + I2C_TIMINGR_OFFSET)     /*!< I2C Timing register,               Address offset: 0x10 */
#define _I2C1_TIMEOUTR    (I2C1 + I2C_TIMEOUTR_OFFSET)    /*!< I2C Timeout register,              Address offset: 0x14 */
#define _I2C1_ISR         (I2C1 + I2C_ISR_OFFSET)         /*!< I2C Interrupt and status register, Address offset: 0x18 */
#define _I2C1_ICR         (I2C1 + I2C_ICR_OFFSET)         /*!< I2C Interrupt clear register,      Address offset: 0x1C */
#define _I2C1_PECR        (I2C1 + I2C_PECR_OFFSET)        /*!< I2C PEC register,                  Address offset: 0x20 */
#define _I2C1_RXDR        (I2C1 + I2C_RXDR_OFFSET)        /*!< I2C Receive data register,         Address offset: 0x24 */
#define _I2C1_TXDR        (I2C1 + I2C_TXDR_OFFSET)        /*!< I2C Transmit data register,        Address offset: 0x28 */

#define I2C2                (I2C2_BASE)
#define _I2C2_CR1         (I2C2 + I2C_CR1_OFFSET)         /*!< I2C Control register 1,            Address offset: 0x00 */
#define _I2C2_CR2         (I2C2 + I2C_CR2_OFFSET)         /*!< I2C Control register 2,            Address offset: 0x04 */
#define _I2C2_OAR1        (I2C2 + I2C_OAR1_OFFSET)        /*!< I2C Own address 1 register,        Address offset: 0x08 */
#define _I2C2_OAR2        (I2C2 + I2C_OAR2_OFFSET)        /*!< I2C Own address 2 register,        Address offset: 0x0C */
#define _I2C2_TIMINGR     (I2C2 + I2C_TIMINGR_OFFSET)     /*!< I2C Timing register,               Address offset: 0x10 */
#define _I2C2_TIMEOUTR    (I2C2 + I2C_TIMEOUTR_OFFSET)    /*!< I2C Timeout register,              Address offset: 0x14 */
#define _I2C2_ISR         (I2C2 + I2C_ISR_OFFSET)         /*!< I2C Interrupt and status register, Address offset: 0x18 */
#define _I2C2_ICR         (I2C2 + I2C_ICR_OFFSET)         /*!< I2C Interrupt clear register,      Address offset: 0x1C */
#define _I2C2_PECR        (I2C2 + I2C_PECR_OFFSET)        /*!< I2C PEC register,                  Address offset: 0x20 */
#define _I2C2_RXDR        (I2C2 + I2C_RXDR_OFFSET)        /*!< I2C Receive data register,         Address offset: 0x24 */
#define _I2C2_TXDR        (I2C2 + I2C_TXDR_OFFSET)        /*!< I2C Transmit data register,        Address offset: 0x28 */

#define I2C3                (I2C3_BASE)
#define _I2C3_CR1         (I2C3 + I2C_CR1_OFFSET)         /*!< I2C Control register 1,            Address offset: 0x00 */
#define _I2C3_CR2         (I2C3 + I2C_CR2_OFFSET)         /*!< I2C Control register 2,            Address offset: 0x04 */
#define _I2C3_OAR1        (I2C3 + I2C_OAR1_OFFSET)        /*!< I2C Own address 1 register,        Address offset: 0x08 */
#define _I2C3_OAR2        (I2C3 + I2C_OAR2_OFFSET)        /*!< I2C Own address 2 register,        Address offset: 0x0C */
#define _I2C3_TIMINGR     (I2C3 + I2C_TIMINGR_OFFSET)     /*!< I2C Timing register,               Address offset: 0x10 */
#define _I2C3_TIMEOUTR    (I2C3 + I2C_TIMEOUTR_OFFSET)    /*!< I2C Timeout register,              Address offset: 0x14 */
#define _I2C3_ISR         (I2C3 + I2C_ISR_OFFSET)         /*!< I2C Interrupt and status register, Address offset: 0x18 */
#define _I2C3_ICR         (I2C3 + I2C_ICR_OFFSET)         /*!< I2C Interrupt clear register,      Address offset: 0x1C */
#define _I2C3_PECR        (I2C3 + I2C_PECR_OFFSET)        /*!< I2C PEC register,                  Address offset: 0x20 */
#define _I2C3_RXDR        (I2C3 + I2C_RXDR_OFFSET)        /*!< I2C Receive data register,         Address offset: 0x24 */
#define _I2C3_TXDR        (I2C3 + I2C_TXDR_OFFSET)        /*!< I2C Transmit data register,        Address offset: 0x28 */

#define CRS                 (CRS_BASE)
#define _CRS_CR      (CRS + CRS_CR_OFFSET)      /*!< CRS ccontrol register,              Address offset: 0x00 */
#define _CRS_CFGR    (CRS + CRS_CFGR_OFFSET)    /*!< CRS configuration register,         Address offset: 0x04 */
#define _CRS_ISR     (CRS + CRS_ISR_OFFSET)     /*!< CRS interrupt and status register,  Address offset: 0x08 */
#define _CRS_ICR     (CRS + CRS_ICR_OFFSET)     /*!< CRS interrupt flag clear register,  Address offset: 0x0C */

