the-nw1-group/acb-modules/acb-common/include/stm/stm32l431xx.inc
#define CAN                 (CAN1_BASE)
#define _CAN_MCR                (CAN + CAN_MCR_OFFSET)                /*!< CAN master control register,         Address offset: 0x00          */
#define _CAN_MSR                (CAN + CAN_MSR_OFFSET)                /*!< CAN master status register,          Address offset: 0x04          */
#define _CAN_TSR                (CAN + CAN_TSR_OFFSET)                /*!< CAN transmit status register,        Address offset: 0x08          */
#define _CAN_RF0R               (CAN + CAN_RF0R_OFFSET)               /*!< CAN receive FIFO 0 register,         Address offset: 0x0C          */
#define _CAN_RF1R               (CAN + CAN_RF1R_OFFSET)               /*!< CAN receive FIFO 1 register,         Address offset: 0x10          */
#define _CAN_IER                (CAN + CAN_IER_OFFSET)                /*!< CAN interrupt enable register,       Address offset: 0x14          */
#define _CAN_ESR                (CAN + CAN_ESR_OFFSET)                /*!< CAN error status register,           Address offset: 0x18          */
#define _CAN_BTR                (CAN + CAN_BTR_OFFSET)                /*!< CAN bit timing register,             Address offset: 0x1C          */
#define _CAN_sTxMailBox         (CAN + CAN_sTxMailBox_OFFSET)         /*!< CAN Tx MailBox,                      Address offset: 0x180 - 0x1AC */
#define _CAN_sFIFOMailBox       (CAN + CAN_sFIFOMailBox_OFFSET)       /*!< CAN FIFO MailBox,                    Address offset: 0x1B0 - 0x1CC */
#define _CAN_FMR                (CAN + CAN_FMR_OFFSET)                /*!< CAN filter master register,          Address offset: 0x200         */
#define _CAN_FM1R               (CAN + CAN_FM1R_OFFSET)               /*!< CAN filter mode register,            Address offset: 0x204         */
#define _CAN_FS1R               (CAN + CAN_FS1R_OFFSET)               /*!< CAN filter scale register,           Address offset: 0x20C         */
#define _CAN_FFA1R              (CAN + CAN_FFA1R_OFFSET)              /*!< CAN filter FIFO assignment register, Address offset: 0x214         */
#define _CAN_FA1R               (CAN + CAN_FA1R_OFFSET)               /*!< CAN filter activation register,      Address offset: 0x21C         */
#define _CAN_sFilterRegister    (CAN + CAN_sFilterRegister_OFFSET)    /*!< CAN Filter Register,                 Address offset: 0x240-0x31C   */

#define CAN1                (CAN1_BASE)
#define _CAN1_MCR                (CAN1 + CAN_MCR_OFFSET)                /*!< CAN master control register,         Address offset: 0x00          */
#define _CAN1_MSR                (CAN1 + CAN_MSR_OFFSET)                /*!< CAN master status register,          Address offset: 0x04          */
#define _CAN1_TSR                (CAN1 + CAN_TSR_OFFSET)                /*!< CAN transmit status register,        Address offset: 0x08          */
#define _CAN1_RF0R               (CAN1 + CAN_RF0R_OFFSET)               /*!< CAN receive FIFO 0 register,         Address offset: 0x0C          */
#define _CAN1_RF1R               (CAN1 + CAN_RF1R_OFFSET)               /*!< CAN receive FIFO 1 register,         Address offset: 0x10          */
#define _CAN1_IER                (CAN1 + CAN_IER_OFFSET)                /*!< CAN interrupt enable register,       Address offset: 0x14          */
#define _CAN1_ESR                (CAN1 + CAN_ESR_OFFSET)                /*!< CAN error status register,           Address offset: 0x18          */
#define _CAN1_BTR                (CAN1 + CAN_BTR_OFFSET)                /*!< CAN bit timing register,             Address offset: 0x1C          */
#define _CAN1_sTxMailBox         (CAN1 + CAN_sTxMailBox_OFFSET)         /*!< CAN Tx MailBox,                      Address offset: 0x180 - 0x1AC */
#define _CAN1_sFIFOMailBox       (CAN1 + CAN_sFIFOMailBox_OFFSET)       /*!< CAN FIFO MailBox,                    Address offset: 0x1B0 - 0x1CC */
#define _CAN1_FMR                (CAN1 + CAN_FMR_OFFSET)                /*!< CAN filter master register,          Address offset: 0x200         */
#define _CAN1_FM1R               (CAN1 + CAN_FM1R_OFFSET)               /*!< CAN filter mode register,            Address offset: 0x204         */
#define _CAN1_FS1R               (CAN1 + CAN_FS1R_OFFSET)               /*!< CAN filter scale register,           Address offset: 0x20C         */
#define _CAN1_FFA1R              (CAN1 + CAN_FFA1R_OFFSET)              /*!< CAN filter FIFO assignment register, Address offset: 0x214         */
#define _CAN1_FA1R               (CAN1 + CAN_FA1R_OFFSET)               /*!< CAN filter activation register,      Address offset: 0x21C         */
#define _CAN1_sFilterRegister    (CAN1 + CAN_sFilterRegister_OFFSET)    /*!< CAN Filter Register,                 Address offset: 0x240-0x31C   */

#define PWR                 (PWR_BASE)
#define _PWR_CR1          (PWR + PWR_CR1_OFFSET)          /*!< PWR power control register 1,        Address offset: 0x00 */
#define _PWR_CR2          (PWR + PWR_CR2_OFFSET)          /*!< PWR power control register 2,        Address offset: 0x04 */
#define _PWR_CR3          (PWR + PWR_CR3_OFFSET)          /*!< PWR power control register 3,        Address offset: 0x08 */
#define _PWR_CR4          (PWR + PWR_CR4_OFFSET)          /*!< PWR power control register 4,        Address offset: 0x0C */
#define _PWR_SR1          (PWR + PWR_SR1_OFFSET)          /*!< PWR power status register 1,         Address offset: 0x10 */
#define _PWR_SR2          (PWR + PWR_SR2_OFFSET)          /*!< PWR power status register 2,         Address offset: 0x14 */
#define _PWR_SCR          (PWR + PWR_SCR_OFFSET)          /*!< PWR power status reset register,     Address offset: 0x18 */
#define _PWR_PUCRA        (PWR + PWR_PUCRA_OFFSET)        /*!< Pull_up control register of portA,   Address offset: 0x20 */
#define _PWR_PDCRA        (PWR + PWR_PDCRA_OFFSET)        /*!< Pull_Down control register of portA, Address offset: 0x24 */
#define _PWR_PUCRB        (PWR + PWR_PUCRB_OFFSET)        /*!< Pull_up control register of portB,   Address offset: 0x28 */
#define _PWR_PDCRB        (PWR + PWR_PDCRB_OFFSET)        /*!< Pull_Down control register of portB, Address offset: 0x2C */
#define _PWR_PUCRC        (PWR + PWR_PUCRC_OFFSET)        /*!< Pull_up control register of portC,   Address offset: 0x30 */
#define _PWR_PDCRC        (PWR + PWR_PDCRC_OFFSET)        /*!< Pull_Down control register of portC, Address offset: 0x34 */
#define _PWR_PUCRD        (PWR + PWR_PUCRD_OFFSET)        /*!< Pull_up control register of portD,   Address offset: 0x38 */
#define _PWR_PDCRD        (PWR + PWR_PDCRD_OFFSET)        /*!< Pull_Down control register of portD, Address offset: 0x3C */
#define _PWR_PUCRE        (PWR + PWR_PUCRE_OFFSET)        /*!< Pull_up control register of portE,   Address offset: 0x40 */
#define _PWR_PDCRE        (PWR + PWR_PDCRE_OFFSET)        /*!< Pull_Down control register of portE, Address offset: 0x44 */
#define _PWR_PUCRH        (PWR + PWR_PUCRH_OFFSET)        /*!< Pull_up control register of portH,   Address offset: 0x58 */
#define _PWR_PDCRH        (PWR + PWR_PDCRH_OFFSET)        /*!< Pull_Down control register of portH, Address offset: 0x5C */

