the-nw1-group/acb-modules/acb-common/include/stm/stm32l431xx.inc
#define DAC                 (DAC1_BASE)
#define _DAC_CR         (DAC + DAC_CR_OFFSET)         /*!< DAC control register,                                    Address offset: 0x00 */
#define _DAC_SWTRIGR    (DAC + DAC_SWTRIGR_OFFSET)    /*!< DAC software trigger register,                           Address offset: 0x04 */
#define _DAC_DHR12R1    (DAC + DAC_DHR12R1_OFFSET)    /*!< DAC channel1 12-bit right-aligned data holding register, Address offset: 0x08 */
#define _DAC_DHR12L1    (DAC + DAC_DHR12L1_OFFSET)    /*!< DAC channel1 12-bit left aligned data holding register,  Address offset: 0x0C */
#define _DAC_DHR8R1     (DAC + DAC_DHR8R1_OFFSET)     /*!< DAC channel1 8-bit right aligned data holding register,  Address offset: 0x10 */
#define _DAC_DHR12R2    (DAC + DAC_DHR12R2_OFFSET)    /*!< DAC channel2 12-bit right aligned data holding register, Address offset: 0x14 */
#define _DAC_DHR12L2    (DAC + DAC_DHR12L2_OFFSET)    /*!< DAC channel2 12-bit left aligned data holding register,  Address offset: 0x18 */
#define _DAC_DHR8R2     (DAC + DAC_DHR8R2_OFFSET)     /*!< DAC channel2 8-bit right-aligned data holding register,  Address offset: 0x1C */
#define _DAC_DHR12RD    (DAC + DAC_DHR12RD_OFFSET)    /*!< Dual DAC 12-bit right-aligned data holding register,     Address offset: 0x20 */
#define _DAC_DHR12LD    (DAC + DAC_DHR12LD_OFFSET)    /*!< DUAL DAC 12-bit left aligned data holding register,      Address offset: 0x24 */
#define _DAC_DHR8RD     (DAC + DAC_DHR8RD_OFFSET)     /*!< DUAL DAC 8-bit right aligned data holding register,      Address offset: 0x28 */
#define _DAC_DOR1       (DAC + DAC_DOR1_OFFSET)       /*!< DAC channel1 data output register,                       Address offset: 0x2C */
#define _DAC_DOR2       (DAC + DAC_DOR2_OFFSET)       /*!< DAC channel2 data output register,                       Address offset: 0x30 */
#define _DAC_SR         (DAC + DAC_SR_OFFSET)         /*!< DAC status register,                                     Address offset: 0x34 */
#define _DAC_CCR        (DAC + DAC_CCR_OFFSET)        /*!< DAC calibration control register,                        Address offset: 0x38 */
#define _DAC_MCR        (DAC + DAC_MCR_OFFSET)        /*!< DAC mode control register,                               Address offset: 0x3C */
#define _DAC_SHSR1      (DAC + DAC_SHSR1_OFFSET)      /*!< DAC Sample and Hold sample time register 1,              Address offset: 0x40 */
#define _DAC_SHSR2      (DAC + DAC_SHSR2_OFFSET)      /*!< DAC Sample and Hold sample time register 2,              Address offset: 0x44 */
#define _DAC_SHHR       (DAC + DAC_SHHR_OFFSET)       /*!< DAC Sample and Hold hold time register,                  Address offset: 0x48 */
#define _DAC_SHRR       (DAC + DAC_SHRR_OFFSET)       /*!< DAC Sample and Hold refresh time register,               Address offset: 0x4C */

#define DAC1                (DAC1_BASE)
#define _DAC1_CR         (DAC1 + DAC_CR_OFFSET)         /*!< DAC control register,                                    Address offset: 0x00 */
#define _DAC1_SWTRIGR    (DAC1 + DAC_SWTRIGR_OFFSET)    /*!< DAC software trigger register,                           Address offset: 0x04 */
#define _DAC1_DHR12R1    (DAC1 + DAC_DHR12R1_OFFSET)    /*!< DAC channel1 12-bit right-aligned data holding register, Address offset: 0x08 */
#define _DAC1_DHR12L1    (DAC1 + DAC_DHR12L1_OFFSET)    /*!< DAC channel1 12-bit left aligned data holding register,  Address offset: 0x0C */
#define _DAC1_DHR8R1     (DAC1 + DAC_DHR8R1_OFFSET)     /*!< DAC channel1 8-bit right aligned data holding register,  Address offset: 0x10 */
#define _DAC1_DHR12R2    (DAC1 + DAC_DHR12R2_OFFSET)    /*!< DAC channel2 12-bit right aligned data holding register, Address offset: 0x14 */
#define _DAC1_DHR12L2    (DAC1 + DAC_DHR12L2_OFFSET)    /*!< DAC channel2 12-bit left aligned data holding register,  Address offset: 0x18 */
#define _DAC1_DHR8R2     (DAC1 + DAC_DHR8R2_OFFSET)     /*!< DAC channel2 8-bit right-aligned data holding register,  Address offset: 0x1C */
#define _DAC1_DHR12RD    (DAC1 + DAC_DHR12RD_OFFSET)    /*!< Dual DAC 12-bit right-aligned data holding register,     Address offset: 0x20 */
#define _DAC1_DHR12LD    (DAC1 + DAC_DHR12LD_OFFSET)    /*!< DUAL DAC 12-bit left aligned data holding register,      Address offset: 0x24 */
#define _DAC1_DHR8RD     (DAC1 + DAC_DHR8RD_OFFSET)     /*!< DUAL DAC 8-bit right aligned data holding register,      Address offset: 0x28 */
#define _DAC1_DOR1       (DAC1 + DAC_DOR1_OFFSET)       /*!< DAC channel1 data output register,                       Address offset: 0x2C */
#define _DAC1_DOR2       (DAC1 + DAC_DOR2_OFFSET)       /*!< DAC channel2 data output register,                       Address offset: 0x30 */
#define _DAC1_SR         (DAC1 + DAC_SR_OFFSET)         /*!< DAC status register,                                     Address offset: 0x34 */
#define _DAC1_CCR        (DAC1 + DAC_CCR_OFFSET)        /*!< DAC calibration control register,                        Address offset: 0x38 */
#define _DAC1_MCR        (DAC1 + DAC_MCR_OFFSET)        /*!< DAC mode control register,                               Address offset: 0x3C */
#define _DAC1_SHSR1      (DAC1 + DAC_SHSR1_OFFSET)      /*!< DAC Sample and Hold sample time register 1,              Address offset: 0x40 */
#define _DAC1_SHSR2      (DAC1 + DAC_SHSR2_OFFSET)      /*!< DAC Sample and Hold sample time register 2,              Address offset: 0x44 */
#define _DAC1_SHHR       (DAC1 + DAC_SHHR_OFFSET)       /*!< DAC Sample and Hold hold time register,                  Address offset: 0x48 */
#define _DAC1_SHRR       (DAC1 + DAC_SHRR_OFFSET)       /*!< DAC Sample and Hold refresh time register,               Address offset: 0x4C */

#define OPAMP               (OPAMP_BASE)
#define _OPAMP_CSR      (OPAMP + OPAMP_CSR_OFFSET)      /*!< OPAMP control/status register,                     Address offset: 0x00 */
#define _OPAMP_OTR      (OPAMP + OPAMP_OTR_OFFSET)      /*!< OPAMP offset trimming register for normal mode,    Address offset: 0x04 */
#define _OPAMP_LPOTR    (OPAMP + OPAMP_LPOTR_OFFSET)    /*!< OPAMP offset trimming register for low power mode, Address offset: 0x08 */

