the-nw1-group/acb-modules/acb-common/include/stm/stm32l431xx.inc
#define OPAMP1              (OPAMP1_BASE)
#define _OPAMP1_CSR      (OPAMP1 + OPAMP_CSR_OFFSET)      /*!< OPAMP control/status register,                     Address offset: 0x00 */
#define _OPAMP1_OTR      (OPAMP1 + OPAMP_OTR_OFFSET)      /*!< OPAMP offset trimming register for normal mode,    Address offset: 0x04 */
#define _OPAMP1_LPOTR    (OPAMP1 + OPAMP_LPOTR_OFFSET)    /*!< OPAMP offset trimming register for low power mode, Address offset: 0x08 */

#define OPAMP1_COMMON       (OPAMP1_BASE)
#define _OPAMP1_COMMON_CSR    (OPAMP1_COMMON + OPAMP_Common_CSR_OFFSET)    /*!< OPAMP control/status register, used for bits common to several OPAMP instances, Address offset: 0x00 */

#define LPTIM1              (LPTIM1_BASE)
#define _LPTIM1_ISR     (LPTIM1 + LPTIM_ISR_OFFSET)     /*!< LPTIM Interrupt and Status register,                Address offset: 0x00 */
#define _LPTIM1_ICR     (LPTIM1 + LPTIM_ICR_OFFSET)     /*!< LPTIM Interrupt Clear register,                     Address offset: 0x04 */
#define _LPTIM1_IER     (LPTIM1 + LPTIM_IER_OFFSET)     /*!< LPTIM Interrupt Enable register,                    Address offset: 0x08 */
#define _LPTIM1_CFGR    (LPTIM1 + LPTIM_CFGR_OFFSET)    /*!< LPTIM Configuration register,                       Address offset: 0x0C */
#define _LPTIM1_CR      (LPTIM1 + LPTIM_CR_OFFSET)      /*!< LPTIM Control register,                             Address offset: 0x10 */
#define _LPTIM1_CMP     (LPTIM1 + LPTIM_CMP_OFFSET)     /*!< LPTIM Compare register,                             Address offset: 0x14 */
#define _LPTIM1_ARR     (LPTIM1 + LPTIM_ARR_OFFSET)     /*!< LPTIM Autoreload register,                          Address offset: 0x18 */
#define _LPTIM1_CNT     (LPTIM1 + LPTIM_CNT_OFFSET)     /*!< LPTIM Counter register,                             Address offset: 0x1C */
#define _LPTIM1_OR      (LPTIM1 + LPTIM_OR_OFFSET)      /*!< LPTIM Option register,                              Address offset: 0x20 */

#define LPUART1             (LPUART1_BASE)
#define _LPUART1_CR1          (LPUART1 + USART_CR1_OFFSET)          /*!< USART Control register 1,                 Address offset: 0x00 */
#define _LPUART1_CR2          (LPUART1 + USART_CR2_OFFSET)          /*!< USART Control register 2,                 Address offset: 0x04 */
#define _LPUART1_CR3          (LPUART1 + USART_CR3_OFFSET)          /*!< USART Control register 3,                 Address offset: 0x08 */
#define _LPUART1_BRR          (LPUART1 + USART_BRR_OFFSET)          /*!< USART Baud rate register,                 Address offset: 0x0C */
#define _LPUART1_GTPR         (LPUART1 + USART_GTPR_OFFSET)         /*!< USART Guard time and prescaler register,  Address offset: 0x10 */
#define _LPUART1_RTOR         (LPUART1 + USART_RTOR_OFFSET)         /*!< USART Receiver Time Out register,         Address offset: 0x14 */
#define _LPUART1_RQR          (LPUART1 + USART_RQR_OFFSET)          /*!< USART Request register,                   Address offset: 0x18 */
#define _LPUART1_ISR          (LPUART1 + USART_ISR_OFFSET)          /*!< USART Interrupt and status register,      Address offset: 0x1C */
#define _LPUART1_ICR          (LPUART1 + USART_ICR_OFFSET)          /*!< USART Interrupt flag Clear register,      Address offset: 0x20 */
#define _LPUART1_RDR          (LPUART1 + USART_RDR_OFFSET)          /*!< USART Receive Data register,              Address offset: 0x24 */
#define _LPUART1_TDR          (LPUART1 + USART_TDR_OFFSET)          /*!< USART Transmit Data register,             Address offset: 0x28 */

#define SWPMI1              (SWPMI1_BASE)
#define _SWPMI1_CR           (SWPMI1 + SWPMI_CR_OFFSET)           /*!< SWPMI Configuration/Control register,     Address offset: 0x00 */
#define _SWPMI1_BRR          (SWPMI1 + SWPMI_BRR_OFFSET)          /*!< SWPMI bitrate register,                   Address offset: 0x04 */
#define _SWPMI1_ISR          (SWPMI1 + SWPMI_ISR_OFFSET)          /*!< SWPMI Interrupt and Status register,      Address offset: 0x0C */
#define _SWPMI1_ICR          (SWPMI1 + SWPMI_ICR_OFFSET)          /*!< SWPMI Interrupt Flag Clear register,      Address offset: 0x10 */
#define _SWPMI1_IER          (SWPMI1 + SWPMI_IER_OFFSET)          /*!< SWPMI Interrupt Enable register,          Address offset: 0x14 */
#define _SWPMI1_RFL          (SWPMI1 + SWPMI_RFL_OFFSET)          /*!< SWPMI Receive Frame Length register,      Address offset: 0x18 */
#define _SWPMI1_TDR          (SWPMI1 + SWPMI_TDR_OFFSET)          /*!< SWPMI Transmit data register,             Address offset: 0x1C */
#define _SWPMI1_RDR          (SWPMI1 + SWPMI_RDR_OFFSET)          /*!< SWPMI Receive data register,              Address offset: 0x20 */
#define _SWPMI1_OR           (SWPMI1 + SWPMI_OR_OFFSET)           /*!< SWPMI Option register,                    Address offset: 0x24 */

#define LPTIM2              (LPTIM2_BASE)
#define _LPTIM2_ISR     (LPTIM2 + LPTIM_ISR_OFFSET)     /*!< LPTIM Interrupt and Status register,                Address offset: 0x00 */
#define _LPTIM2_ICR     (LPTIM2 + LPTIM_ICR_OFFSET)     /*!< LPTIM Interrupt Clear register,                     Address offset: 0x04 */
#define _LPTIM2_IER     (LPTIM2 + LPTIM_IER_OFFSET)     /*!< LPTIM Interrupt Enable register,                    Address offset: 0x08 */
#define _LPTIM2_CFGR    (LPTIM2 + LPTIM_CFGR_OFFSET)    /*!< LPTIM Configuration register,                       Address offset: 0x0C */
#define _LPTIM2_CR      (LPTIM2 + LPTIM_CR_OFFSET)      /*!< LPTIM Control register,                             Address offset: 0x10 */
#define _LPTIM2_CMP     (LPTIM2 + LPTIM_CMP_OFFSET)     /*!< LPTIM Compare register,                             Address offset: 0x14 */
#define _LPTIM2_ARR     (LPTIM2 + LPTIM_ARR_OFFSET)     /*!< LPTIM Autoreload register,                          Address offset: 0x18 */
#define _LPTIM2_CNT     (LPTIM2 + LPTIM_CNT_OFFSET)     /*!< LPTIM Counter register,                             Address offset: 0x1C */
#define _LPTIM2_OR      (LPTIM2 + LPTIM_OR_OFFSET)      /*!< LPTIM Option register,                              Address offset: 0x20 */


#define SYSCFG              (SYSCFG_BASE)
#define _SYSCFG_MEMRMP    (SYSCFG + SYSCFG_MEMRMP_OFFSET)    /*!< SYSCFG memory remap register,                      Address offset: 0x00      */
#define _SYSCFG_CFGR1     (SYSCFG + SYSCFG_CFGR1_OFFSET)     /*!< SYSCFG configuration register 1,                   Address offset: 0x04      */
#define _SYSCFG_EXTICR    (SYSCFG + SYSCFG_EXTICR_OFFSET)    /*!< SYSCFG external interrupt configuration registers, Address offset: 0x08-0x14 */
#define _SYSCFG_SCSR      (SYSCFG + SYSCFG_SCSR_OFFSET)      /*!< SYSCFG SRAM2 control and status register,          Address offset: 0x18      */
#define _SYSCFG_CFGR2     (SYSCFG + SYSCFG_CFGR2_OFFSET)     /*!< SYSCFG configuration register 2,                   Address offset: 0x1C      */
#define _SYSCFG_SWPR      (SYSCFG + SYSCFG_SWPR_OFFSET)      /*!< SYSCFG SRAM2 write protection register,            Address offset: 0x20      */
#define _SYSCFG_SKR       (SYSCFG + SYSCFG_SKR_OFFSET)       /*!< SYSCFG SRAM2 key register,                         Address offset: 0x24      */

#define VREFBUF             (VREFBUF_BASE)
#define _VREFBUF_CSR    (VREFBUF + VREFBUF_CSR_OFFSET)    /*!< VREFBUF control and status register,         Address offset: 0x00 */
#define _VREFBUF_CCR    (VREFBUF + VREFBUF_CCR_OFFSET)    /*!< VREFBUF calibration and control register,    Address offset: 0x04 */

