the-nw1-group/acb-modules/acb-common/include/stm/stm32l431xx.inc
#define COMP1               (COMP1_BASE)
#define _COMP1_CSR    (COMP1 + COMP_CSR_OFFSET)    /*!< COMP control and status register, Address offset: 0x00 */

#define COMP2               (COMP2_BASE)
#define _COMP2_CSR    (COMP2 + COMP_CSR_OFFSET)    /*!< COMP control and status register, Address offset: 0x00 */

#define COMP12_COMMON       (COMP2_BASE)
#define _COMP12_COMMON_CSR    (COMP12_COMMON + COMP_Common_CSR_OFFSET)    /*!< COMP control and status register, used for bits common to several COMP instances, Address offset: 0x00 */

#define EXTI                (EXTI_BASE)
#define _EXTI_IMR1         (EXTI + EXTI_IMR1_OFFSET)         /*!< EXTI Interrupt mask register 1,             Address offset: 0x00 */
#define _EXTI_EMR1         (EXTI + EXTI_EMR1_OFFSET)         /*!< EXTI Event mask register 1,                 Address offset: 0x04 */
#define _EXTI_RTSR1        (EXTI + EXTI_RTSR1_OFFSET)        /*!< EXTI Rising trigger selection register 1,   Address offset: 0x08 */
#define _EXTI_FTSR1        (EXTI + EXTI_FTSR1_OFFSET)        /*!< EXTI Falling trigger selection register 1,  Address offset: 0x0C */
#define _EXTI_SWIER1       (EXTI + EXTI_SWIER1_OFFSET)       /*!< EXTI Software interrupt event register 1,   Address offset: 0x10 */
#define _EXTI_PR1          (EXTI + EXTI_PR1_OFFSET)          /*!< EXTI Pending register 1,                    Address offset: 0x14 */
#define _EXTI_IMR2         (EXTI + EXTI_IMR2_OFFSET)         /*!< EXTI Interrupt mask register 2,             Address offset: 0x20 */
#define _EXTI_EMR2         (EXTI + EXTI_EMR2_OFFSET)         /*!< EXTI Event mask register 2,                 Address offset: 0x24 */
#define _EXTI_RTSR2        (EXTI + EXTI_RTSR2_OFFSET)        /*!< EXTI Rising trigger selection register 2,   Address offset: 0x28 */
#define _EXTI_FTSR2        (EXTI + EXTI_FTSR2_OFFSET)        /*!< EXTI Falling trigger selection register 2,  Address offset: 0x2C */
#define _EXTI_SWIER2       (EXTI + EXTI_SWIER2_OFFSET)       /*!< EXTI Software interrupt event register 2,   Address offset: 0x30 */
#define _EXTI_PR2          (EXTI + EXTI_PR2_OFFSET)          /*!< EXTI Pending register 2,                    Address offset: 0x34 */

#define FIREWALL            (FIREWALL_BASE)
#define _FIREWALL_CSSA         (FIREWALL + FIREWALL_CSSA_OFFSET)         /*!< Code Segment Start Address register,              Address offset: 0x00 */
#define _FIREWALL_CSL          (FIREWALL + FIREWALL_CSL_OFFSET)          /*!< Code Segment Length register,                      Address offset: 0x04 */
#define _FIREWALL_NVDSSA       (FIREWALL + FIREWALL_NVDSSA_OFFSET)       /*!< NON volatile data Segment Start Address register,  Address offset: 0x08 */
#define _FIREWALL_NVDSL        (FIREWALL + FIREWALL_NVDSL_OFFSET)        /*!< NON volatile data Segment Length register,         Address offset: 0x0C */
#define _FIREWALL_VDSSA        (FIREWALL + FIREWALL_VDSSA_OFFSET)        /*!< Volatile data Segment Start Address register,      Address offset: 0x10 */
#define _FIREWALL_VDSL         (FIREWALL + FIREWALL_VDSL_OFFSET)         /*!< Volatile data Segment Length register,             Address offset: 0x14 */
#define _FIREWALL_CR           (FIREWALL + FIREWALL_CR_OFFSET)           /*!< Configuration  register,                           Address offset: 0x20 */

#define SDMMC1              (SDMMC1_BASE)
#define _SDMMC1_POWER        (SDMMC1 + SDMMC_POWER_OFFSET)        /*!< SDMMC power control register,    Address offset: 0x00 */
#define _SDMMC1_CLKCR        (SDMMC1 + SDMMC_CLKCR_OFFSET)        /*!< SDMMC clock control register,    Address offset: 0x04 */
#define _SDMMC1_ARG          (SDMMC1 + SDMMC_ARG_OFFSET)          /*!< SDMMC argument register,         Address offset: 0x08 */
#define _SDMMC1_CMD          (SDMMC1 + SDMMC_CMD_OFFSET)          /*!< SDMMC command register,          Address offset: 0x0C */
#define _SDMMC1_RESPCMD      (SDMMC1 + SDMMC_RESPCMD_OFFSET)      /*!< SDMMC command response register, Address offset: 0x10 */
#define _SDMMC1_RESP1        (SDMMC1 + SDMMC_RESP1_OFFSET)        /*!< SDMMC response 1 register,       Address offset: 0x14 */
#define _SDMMC1_RESP2        (SDMMC1 + SDMMC_RESP2_OFFSET)        /*!< SDMMC response 2 register,       Address offset: 0x18 */
#define _SDMMC1_RESP3        (SDMMC1 + SDMMC_RESP3_OFFSET)        /*!< SDMMC response 3 register,       Address offset: 0x1C */
#define _SDMMC1_RESP4        (SDMMC1 + SDMMC_RESP4_OFFSET)        /*!< SDMMC response 4 register,       Address offset: 0x20 */
#define _SDMMC1_DTIMER       (SDMMC1 + SDMMC_DTIMER_OFFSET)       /*!< SDMMC data timer register,       Address offset: 0x24 */
#define _SDMMC1_DLEN         (SDMMC1 + SDMMC_DLEN_OFFSET)         /*!< SDMMC data length register,      Address offset: 0x28 */
#define _SDMMC1_DCTRL        (SDMMC1 + SDMMC_DCTRL_OFFSET)        /*!< SDMMC data control register,     Address offset: 0x2C */
#define _SDMMC1_DCOUNT       (SDMMC1 + SDMMC_DCOUNT_OFFSET)       /*!< SDMMC data counter register,     Address offset: 0x30 */
#define _SDMMC1_STA          (SDMMC1 + SDMMC_STA_OFFSET)          /*!< SDMMC status register,           Address offset: 0x34 */
#define _SDMMC1_ICR          (SDMMC1 + SDMMC_ICR_OFFSET)          /*!< SDMMC interrupt clear register,  Address offset: 0x38 */
#define _SDMMC1_MASK         (SDMMC1 + SDMMC_MASK_OFFSET)         /*!< SDMMC mask register,             Address offset: 0x3C */
#define _SDMMC1_FIFOCNT      (SDMMC1 + SDMMC_FIFOCNT_OFFSET)      /*!< SDMMC FIFO counter register,     Address offset: 0x48 */
#define _SDMMC1_FIFO         (SDMMC1 + SDMMC_FIFO_OFFSET)         /*!< SDMMC data FIFO register,        Address offset: 0x80 */

#define TIM1                (TIM1_BASE)
#define _TIM1_CR1      (TIM1 + TIM_CR1_OFFSET)      /*!< TIM control register 1,                   Address offset: 0x00 */
#define _TIM1_CR2      (TIM1 + TIM_CR2_OFFSET)      /*!< TIM control register 2,                   Address offset: 0x04 */
#define _TIM1_SMCR     (TIM1 + TIM_SMCR_OFFSET)     /*!< TIM slave mode control register,          Address offset: 0x08 */
#define _TIM1_DIER     (TIM1 + TIM_DIER_OFFSET)     /*!< TIM DMA/interrupt enable register,        Address offset: 0x0C */
#define _TIM1_SR       (TIM1 + TIM_SR_OFFSET)       /*!< TIM status register,                      Address offset: 0x10 */
#define _TIM1_EGR      (TIM1 + TIM_EGR_OFFSET)      /*!< TIM event generation register,            Address offset: 0x14 */
#define _TIM1_CCMR1    (TIM1 + TIM_CCMR1_OFFSET)    /*!< TIM capture/compare mode register 1,      Address offset: 0x18 */
#define _TIM1_CCMR2    (TIM1 + TIM_CCMR2_OFFSET)    /*!< TIM capture/compare mode register 2,      Address offset: 0x1C */
#define _TIM1_CCER     (TIM1 + TIM_CCER_OFFSET)     /*!< TIM capture/compare enable register,      Address offset: 0x20 */
#define _TIM1_CNT      (TIM1 + TIM_CNT_OFFSET)      /*!< TIM counter register,                     Address offset: 0x24 */
#define _TIM1_PSC      (TIM1 + TIM_PSC_OFFSET)      /*!< TIM prescaler,                            Address offset: 0x28 */
#define _TIM1_ARR      (TIM1 + TIM_ARR_OFFSET)      /*!< TIM auto-reload register,                 Address offset: 0x2C */
#define _TIM1_RCR      (TIM1 + TIM_RCR_OFFSET)      /*!< TIM repetition counter register,          Address offset: 0x30 */
#define _TIM1_CCR1     (TIM1 + TIM_CCR1_OFFSET)     /*!< TIM capture/compare register 1,           Address offset: 0x34 */
#define _TIM1_CCR2     (TIM1 + TIM_CCR2_OFFSET)     /*!< TIM capture/compare register 2,           Address offset: 0x38 */
#define _TIM1_CCR3     (TIM1 + TIM_CCR3_OFFSET)     /*!< TIM capture/compare register 3,           Address offset: 0x3C */
#define _TIM1_CCR4     (TIM1 + TIM_CCR4_OFFSET)     /*!< TIM capture/compare register 4,           Address offset: 0x40 */
#define _TIM1_BDTR     (TIM1 + TIM_BDTR_OFFSET)     /*!< TIM break and dead-time register,         Address offset: 0x44 */
#define _TIM1_DCR      (TIM1 + TIM_DCR_OFFSET)      /*!< TIM DMA control register,                 Address offset: 0x48 */
#define _TIM1_DMAR     (TIM1 + TIM_DMAR_OFFSET)     /*!< TIM DMA address for full transfer,        Address offset: 0x4C */
#define _TIM1_OR1      (TIM1 + TIM_OR1_OFFSET)      /*!< TIM option register 1,                    Address offset: 0x50 */
#define _TIM1_CCMR3    (TIM1 + TIM_CCMR3_OFFSET)    /*!< TIM capture/compare mode register 3,      Address offset: 0x54 */
#define _TIM1_CCR5     (TIM1 + TIM_CCR5_OFFSET)     /*!< TIM capture/compare register5,            Address offset: 0x58 */
#define _TIM1_CCR6     (TIM1 + TIM_CCR6_OFFSET)     /*!< TIM capture/compare register6,            Address offset: 0x5C */
#define _TIM1_OR2      (TIM1 + TIM_OR2_OFFSET)      /*!< TIM option register 2,                    Address offset: 0x60 */
#define _TIM1_OR3      (TIM1 + TIM_OR3_OFFSET)      /*!< TIM option register 3,                    Address offset: 0x64 */

#define SPI1                (SPI1_BASE)
#define _SPI1_CR1       (SPI1 + SPI_CR1_OFFSET)       /*!< SPI Control register 1,                              Address offset: 0x00 */
#define _SPI1_CR2       (SPI1 + SPI_CR2_OFFSET)       /*!< SPI Control register 2,                              Address offset: 0x04 */
#define _SPI1_SR        (SPI1 + SPI_SR_OFFSET)        /*!< SPI Status register,                                 Address offset: 0x08 */
#define _SPI1_DR        (SPI1 + SPI_DR_OFFSET)        /*!< SPI data register,                                   Address offset: 0x0C */
#define _SPI1_CRCPR     (SPI1 + SPI_CRCPR_OFFSET)     /*!< SPI CRC polynomial register,                         Address offset: 0x10 */
#define _SPI1_RXCRCR    (SPI1 + SPI_RXCRCR_OFFSET)    /*!< SPI Rx CRC register,                                 Address offset: 0x14 */
#define _SPI1_TXCRCR    (SPI1 + SPI_TXCRCR_OFFSET)    /*!< SPI Tx CRC register,                                 Address offset: 0x18 */

#define USART1              (USART1_BASE)
#define _USART1_CR1          (USART1 + USART_CR1_OFFSET)          /*!< USART Control register 1,                 Address offset: 0x00 */
#define _USART1_CR2          (USART1 + USART_CR2_OFFSET)          /*!< USART Control register 2,                 Address offset: 0x04 */
#define _USART1_CR3          (USART1 + USART_CR3_OFFSET)          /*!< USART Control register 3,                 Address offset: 0x08 */
#define _USART1_BRR          (USART1 + USART_BRR_OFFSET)          /*!< USART Baud rate register,                 Address offset: 0x0C */
#define _USART1_GTPR         (USART1 + USART_GTPR_OFFSET)         /*!< USART Guard time and prescaler register,  Address offset: 0x10 */
#define _USART1_RTOR         (USART1 + USART_RTOR_OFFSET)         /*!< USART Receiver Time Out register,         Address offset: 0x14 */
#define _USART1_RQR          (USART1 + USART_RQR_OFFSET)          /*!< USART Request register,                   Address offset: 0x18 */
#define _USART1_ISR          (USART1 + USART_ISR_OFFSET)          /*!< USART Interrupt and status register,      Address offset: 0x1C */
#define _USART1_ICR          (USART1 + USART_ICR_OFFSET)          /*!< USART Interrupt flag Clear register,      Address offset: 0x20 */
#define _USART1_RDR          (USART1 + USART_RDR_OFFSET)          /*!< USART Receive Data register,              Address offset: 0x24 */
#define _USART1_TDR          (USART1 + USART_TDR_OFFSET)          /*!< USART Transmit Data register,             Address offset: 0x28 */

#define TIM15               (TIM15_BASE)
#define _TIM15_CR1      (TIM15 + TIM_CR1_OFFSET)      /*!< TIM control register 1,                   Address offset: 0x00 */
#define _TIM15_CR2      (TIM15 + TIM_CR2_OFFSET)      /*!< TIM control register 2,                   Address offset: 0x04 */
#define _TIM15_SMCR     (TIM15 + TIM_SMCR_OFFSET)     /*!< TIM slave mode control register,          Address offset: 0x08 */
#define _TIM15_DIER     (TIM15 + TIM_DIER_OFFSET)     /*!< TIM DMA/interrupt enable register,        Address offset: 0x0C */
#define _TIM15_SR       (TIM15 + TIM_SR_OFFSET)       /*!< TIM status register,                      Address offset: 0x10 */
#define _TIM15_EGR      (TIM15 + TIM_EGR_OFFSET)      /*!< TIM event generation register,            Address offset: 0x14 */
#define _TIM15_CCMR1    (TIM15 + TIM_CCMR1_OFFSET)    /*!< TIM capture/compare mode register 1,      Address offset: 0x18 */
#define _TIM15_CCMR2    (TIM15 + TIM_CCMR2_OFFSET)    /*!< TIM capture/compare mode register 2,      Address offset: 0x1C */
#define _TIM15_CCER     (TIM15 + TIM_CCER_OFFSET)     /*!< TIM capture/compare enable register,      Address offset: 0x20 */
#define _TIM15_CNT      (TIM15 + TIM_CNT_OFFSET)      /*!< TIM counter register,                     Address offset: 0x24 */
#define _TIM15_PSC      (TIM15 + TIM_PSC_OFFSET)      /*!< TIM prescaler,                            Address offset: 0x28 */
#define _TIM15_ARR      (TIM15 + TIM_ARR_OFFSET)      /*!< TIM auto-reload register,                 Address offset: 0x2C */
#define _TIM15_RCR      (TIM15 + TIM_RCR_OFFSET)      /*!< TIM repetition counter register,          Address offset: 0x30 */
#define _TIM15_CCR1     (TIM15 + TIM_CCR1_OFFSET)     /*!< TIM capture/compare register 1,           Address offset: 0x34 */
#define _TIM15_CCR2     (TIM15 + TIM_CCR2_OFFSET)     /*!< TIM capture/compare register 2,           Address offset: 0x38 */
#define _TIM15_CCR3     (TIM15 + TIM_CCR3_OFFSET)     /*!< TIM capture/compare register 3,           Address offset: 0x3C */
#define _TIM15_CCR4     (TIM15 + TIM_CCR4_OFFSET)     /*!< TIM capture/compare register 4,           Address offset: 0x40 */
#define _TIM15_BDTR     (TIM15 + TIM_BDTR_OFFSET)     /*!< TIM break and dead-time register,         Address offset: 0x44 */
#define _TIM15_DCR      (TIM15 + TIM_DCR_OFFSET)      /*!< TIM DMA control register,                 Address offset: 0x48 */
#define _TIM15_DMAR     (TIM15 + TIM_DMAR_OFFSET)     /*!< TIM DMA address for full transfer,        Address offset: 0x4C */
#define _TIM15_OR1      (TIM15 + TIM_OR1_OFFSET)      /*!< TIM option register 1,                    Address offset: 0x50 */
#define _TIM15_CCMR3    (TIM15 + TIM_CCMR3_OFFSET)    /*!< TIM capture/compare mode register 3,      Address offset: 0x54 */
#define _TIM15_CCR5     (TIM15 + TIM_CCR5_OFFSET)     /*!< TIM capture/compare register5,            Address offset: 0x58 */
#define _TIM15_CCR6     (TIM15 + TIM_CCR6_OFFSET)     /*!< TIM capture/compare register6,            Address offset: 0x5C */
#define _TIM15_OR2      (TIM15 + TIM_OR2_OFFSET)      /*!< TIM option register 2,                    Address offset: 0x60 */
#define _TIM15_OR3      (TIM15 + TIM_OR3_OFFSET)      /*!< TIM option register 3,                    Address offset: 0x64 */

#define TIM16               (TIM16_BASE)
#define _TIM16_CR1      (TIM16 + TIM_CR1_OFFSET)      /*!< TIM control register 1,                   Address offset: 0x00 */
#define _TIM16_CR2      (TIM16 + TIM_CR2_OFFSET)      /*!< TIM control register 2,                   Address offset: 0x04 */
#define _TIM16_SMCR     (TIM16 + TIM_SMCR_OFFSET)     /*!< TIM slave mode control register,          Address offset: 0x08 */
#define _TIM16_DIER     (TIM16 + TIM_DIER_OFFSET)     /*!< TIM DMA/interrupt enable register,        Address offset: 0x0C */
#define _TIM16_SR       (TIM16 + TIM_SR_OFFSET)       /*!< TIM status register,                      Address offset: 0x10 */
#define _TIM16_EGR      (TIM16 + TIM_EGR_OFFSET)      /*!< TIM event generation register,            Address offset: 0x14 */
#define _TIM16_CCMR1    (TIM16 + TIM_CCMR1_OFFSET)    /*!< TIM capture/compare mode register 1,      Address offset: 0x18 */
#define _TIM16_CCMR2    (TIM16 + TIM_CCMR2_OFFSET)    /*!< TIM capture/compare mode register 2,      Address offset: 0x1C */
#define _TIM16_CCER     (TIM16 + TIM_CCER_OFFSET)     /*!< TIM capture/compare enable register,      Address offset: 0x20 */
#define _TIM16_CNT      (TIM16 + TIM_CNT_OFFSET)      /*!< TIM counter register,                     Address offset: 0x24 */
#define _TIM16_PSC      (TIM16 + TIM_PSC_OFFSET)      /*!< TIM prescaler,                            Address offset: 0x28 */
#define _TIM16_ARR      (TIM16 + TIM_ARR_OFFSET)      /*!< TIM auto-reload register,                 Address offset: 0x2C */
#define _TIM16_RCR      (TIM16 + TIM_RCR_OFFSET)      /*!< TIM repetition counter register,          Address offset: 0x30 */
#define _TIM16_CCR1     (TIM16 + TIM_CCR1_OFFSET)     /*!< TIM capture/compare register 1,           Address offset: 0x34 */
#define _TIM16_CCR2     (TIM16 + TIM_CCR2_OFFSET)     /*!< TIM capture/compare register 2,           Address offset: 0x38 */
#define _TIM16_CCR3     (TIM16 + TIM_CCR3_OFFSET)     /*!< TIM capture/compare register 3,           Address offset: 0x3C */
#define _TIM16_CCR4     (TIM16 + TIM_CCR4_OFFSET)     /*!< TIM capture/compare register 4,           Address offset: 0x40 */
#define _TIM16_BDTR     (TIM16 + TIM_BDTR_OFFSET)     /*!< TIM break and dead-time register,         Address offset: 0x44 */
#define _TIM16_DCR      (TIM16 + TIM_DCR_OFFSET)      /*!< TIM DMA control register,                 Address offset: 0x48 */
#define _TIM16_DMAR     (TIM16 + TIM_DMAR_OFFSET)     /*!< TIM DMA address for full transfer,        Address offset: 0x4C */
#define _TIM16_OR1      (TIM16 + TIM_OR1_OFFSET)      /*!< TIM option register 1,                    Address offset: 0x50 */
#define _TIM16_CCMR3    (TIM16 + TIM_CCMR3_OFFSET)    /*!< TIM capture/compare mode register 3,      Address offset: 0x54 */
#define _TIM16_CCR5     (TIM16 + TIM_CCR5_OFFSET)     /*!< TIM capture/compare register5,            Address offset: 0x58 */
#define _TIM16_CCR6     (TIM16 + TIM_CCR6_OFFSET)     /*!< TIM capture/compare register6,            Address offset: 0x5C */
#define _TIM16_OR2      (TIM16 + TIM_OR2_OFFSET)      /*!< TIM option register 2,                    Address offset: 0x60 */
#define _TIM16_OR3      (TIM16 + TIM_OR3_OFFSET)      /*!< TIM option register 3,                    Address offset: 0x64 */

#define SAI1                (SAI1_BASE)
#define _SAI1_GCR    (SAI1 + SAI_GCR_OFFSET)    /*!< SAI global configuration register,        Address offset: 0x00 */

#define SAI1_Block_A        (AI1_Block_A_BASE)
#define _SAI1_Block_A_CR1      (SAI1_Block_A + SAI_Block_CR1_OFFSET)      /*!< SAI block x configuration register 1,     Address offset: 0x04 */
#define _SAI1_Block_A_CR2      (SAI1_Block_A + SAI_Block_CR2_OFFSET)      /*!< SAI block x configuration register 2,     Address offset: 0x08 */
#define _SAI1_Block_A_FRCR     (SAI1_Block_A + SAI_Block_FRCR_OFFSET)     /*!< SAI block x frame configuration register, Address offset: 0x0C */
#define _SAI1_Block_A_SLOTR    (SAI1_Block_A + SAI_Block_SLOTR_OFFSET)    /*!< SAI block x slot register,                Address offset: 0x10 */
#define _SAI1_Block_A_IMR      (SAI1_Block_A + SAI_Block_IMR_OFFSET)      /*!< SAI block x interrupt mask register,      Address offset: 0x14 */
#define _SAI1_Block_A_SR       (SAI1_Block_A + SAI_Block_SR_OFFSET)       /*!< SAI block x status register,              Address offset: 0x18 */
#define _SAI1_Block_A_CLRFR    (SAI1_Block_A + SAI_Block_CLRFR_OFFSET)    /*!< SAI block x clear flag register,          Address offset: 0x1C */
#define _SAI1_Block_A_DR       (SAI1_Block_A + SAI_Block_DR_OFFSET)       /*!< SAI block x data register,                Address offset: 0x20 */

#define SAI1_Block_B        (AI1_Block_B_BASE)
#define _SAI1_Block_B_CR1      (SAI1_Block_B + SAI_Block_CR1_OFFSET)      /*!< SAI block x configuration register 1,     Address offset: 0x04 */
#define _SAI1_Block_B_CR2      (SAI1_Block_B + SAI_Block_CR2_OFFSET)      /*!< SAI block x configuration register 2,     Address offset: 0x08 */
#define _SAI1_Block_B_FRCR     (SAI1_Block_B + SAI_Block_FRCR_OFFSET)     /*!< SAI block x frame configuration register, Address offset: 0x0C */
#define _SAI1_Block_B_SLOTR    (SAI1_Block_B + SAI_Block_SLOTR_OFFSET)    /*!< SAI block x slot register,                Address offset: 0x10 */
#define _SAI1_Block_B_IMR      (SAI1_Block_B + SAI_Block_IMR_OFFSET)      /*!< SAI block x interrupt mask register,      Address offset: 0x14 */
#define _SAI1_Block_B_SR       (SAI1_Block_B + SAI_Block_SR_OFFSET)       /*!< SAI block x status register,              Address offset: 0x18 */
#define _SAI1_Block_B_CLRFR    (SAI1_Block_B + SAI_Block_CLRFR_OFFSET)    /*!< SAI block x clear flag register,          Address offset: 0x1C */
#define _SAI1_Block_B_DR       (SAI1_Block_B + SAI_Block_DR_OFFSET)       /*!< SAI block x data register,                Address offset: 0x20 */

#define DMA1                (DMA1_BASE)
#define _DMA1_ISR     (DMA1 + DMA_ISR_OFFSET)     /*!< DMA interrupt status register,                 Address offset: 0x00 */
#define _DMA1_IFCR    (DMA1 + DMA_IFCR_OFFSET)    /*!< DMA interrupt flag clear register,             Address offset: 0x04 */

#define DMA2                (DMA2_BASE)
#define _DMA2_ISR     (DMA2 + DMA_ISR_OFFSET)     /*!< DMA interrupt status register,                 Address offset: 0x00 */
#define _DMA2_IFCR    (DMA2 + DMA_IFCR_OFFSET)    /*!< DMA interrupt flag clear register,             Address offset: 0x04 */

