the-nw1-group/acb-modules/acb-common/include/stm/stm32l431xx.inc
#define RCC                 (RCC_BASE)
#define _RCC_CR             (RCC + RCC_CR_OFFSET)             /*!< RCC clock control register,                                              Address offset: 0x00 */
#define _RCC_ICSCR          (RCC + RCC_ICSCR_OFFSET)          /*!< RCC internal clock sources calibration register,                         Address offset: 0x04 */
#define _RCC_CFGR           (RCC + RCC_CFGR_OFFSET)           /*!< RCC clock configuration register,                                        Address offset: 0x08 */
#define _RCC_PLLCFGR        (RCC + RCC_PLLCFGR_OFFSET)        /*!< RCC system PLL configuration register,                                   Address offset: 0x0C */
#define _RCC_PLLSAI1CFGR    (RCC + RCC_PLLSAI1CFGR_OFFSET)    /*!< RCC PLL SAI1 configuration register,                                     Address offset: 0x10 */
#define _RCC_CIER           (RCC + RCC_CIER_OFFSET)           /*!< RCC clock interrupt enable register,                                     Address offset: 0x18 */
#define _RCC_CIFR           (RCC + RCC_CIFR_OFFSET)           /*!< RCC clock interrupt flag register,                                       Address offset: 0x1C */
#define _RCC_CICR           (RCC + RCC_CICR_OFFSET)           /*!< RCC clock interrupt clear register,                                      Address offset: 0x20 */
#define _RCC_AHB1RSTR       (RCC + RCC_AHB1RSTR_OFFSET)       /*!< RCC AHB1 peripheral reset register,                                      Address offset: 0x28 */
#define _RCC_AHB2RSTR       (RCC + RCC_AHB2RSTR_OFFSET)       /*!< RCC AHB2 peripheral reset register,                                      Address offset: 0x2C */
#define _RCC_AHB3RSTR       (RCC + RCC_AHB3RSTR_OFFSET)       /*!< RCC AHB3 peripheral reset register,                                      Address offset: 0x30 */
#define _RCC_APB1RSTR1      (RCC + RCC_APB1RSTR1_OFFSET)      /*!< RCC APB1 peripheral reset register 1,                                    Address offset: 0x38 */
#define _RCC_APB1RSTR2      (RCC + RCC_APB1RSTR2_OFFSET)      /*!< RCC APB1 peripheral reset register 2,                                    Address offset: 0x3C */
#define _RCC_APB2RSTR       (RCC + RCC_APB2RSTR_OFFSET)       /*!< RCC APB2 peripheral reset register,                                      Address offset: 0x40 */
#define _RCC_AHB1ENR        (RCC + RCC_AHB1ENR_OFFSET)        /*!< RCC AHB1 peripheral clocks enable register,                              Address offset: 0x48 */
#define _RCC_AHB2ENR        (RCC + RCC_AHB2ENR_OFFSET)        /*!< RCC AHB2 peripheral clocks enable register,                              Address offset: 0x4C */
#define _RCC_AHB3ENR        (RCC + RCC_AHB3ENR_OFFSET)        /*!< RCC AHB3 peripheral clocks enable register,                              Address offset: 0x50 */
#define _RCC_APB1ENR1       (RCC + RCC_APB1ENR1_OFFSET)       /*!< RCC APB1 peripheral clocks enable register 1,                            Address offset: 0x58 */
#define _RCC_APB1ENR2       (RCC + RCC_APB1ENR2_OFFSET)       /*!< RCC APB1 peripheral clocks enable register 2,                            Address offset: 0x5C */
#define _RCC_APB2ENR        (RCC + RCC_APB2ENR_OFFSET)        /*!< RCC APB2 peripheral clocks enable register,                              Address offset: 0x60 */
#define _RCC_AHB1SMENR      (RCC + RCC_AHB1SMENR_OFFSET)      /*!< RCC AHB1 peripheral clocks enable in sleep and stop modes register,      Address offset: 0x68 */
#define _RCC_AHB2SMENR      (RCC + RCC_AHB2SMENR_OFFSET)      /*!< RCC AHB2 peripheral clocks enable in sleep and stop modes register,      Address offset: 0x6C */
#define _RCC_AHB3SMENR      (RCC + RCC_AHB3SMENR_OFFSET)      /*!< RCC AHB3 peripheral clocks enable in sleep and stop modes register,      Address offset: 0x70 */
#define _RCC_APB1SMENR1     (RCC + RCC_APB1SMENR1_OFFSET)     /*!< RCC APB1 peripheral clocks enable in sleep mode and stop modes register 1, Address offset: 0x78 */
#define _RCC_APB1SMENR2     (RCC + RCC_APB1SMENR2_OFFSET)     /*!< RCC APB1 peripheral clocks enable in sleep mode and stop modes register 2, Address offset: 0x7C */
#define _RCC_APB2SMENR      (RCC + RCC_APB2SMENR_OFFSET)      /*!< RCC APB2 peripheral clocks enable in sleep mode and stop modes register, Address offset: 0x80 */
#define _RCC_CCIPR          (RCC + RCC_CCIPR_OFFSET)          /*!< RCC peripherals independent clock configuration register,                Address offset: 0x88 */
#define _RCC_BDCR           (RCC + RCC_BDCR_OFFSET)           /*!< RCC backup domain control register,                                      Address offset: 0x90 */
#define _RCC_CSR            (RCC + RCC_CSR_OFFSET)            /*!< RCC clock control & status register,                                     Address offset: 0x94 */
#define _RCC_CRRCR          (RCC + RCC_CRRCR_OFFSET)          /*!< RCC clock recovery RC register,                                          Address offset: 0x98 */

#define FLASH               (FLASH_R_BASE)
#define _FLASH_ACR          (FLASH + FLASH_ACR_OFFSET)          /*!< FLASH access control register,            Address offset: 0x00 */
#define _FLASH_PDKEYR       (FLASH + FLASH_PDKEYR_OFFSET)       /*!< FLASH power down key register,            Address offset: 0x04 */
#define _FLASH_KEYR         (FLASH + FLASH_KEYR_OFFSET)         /*!< FLASH key register,                       Address offset: 0x08 */
#define _FLASH_OPTKEYR      (FLASH + FLASH_OPTKEYR_OFFSET)      /*!< FLASH option key register,                Address offset: 0x0C */
#define _FLASH_SR           (FLASH + FLASH_SR_OFFSET)           /*!< FLASH status register,                    Address offset: 0x10 */
#define _FLASH_CR           (FLASH + FLASH_CR_OFFSET)           /*!< FLASH control register,                   Address offset: 0x14 */
#define _FLASH_ECCR         (FLASH + FLASH_ECCR_OFFSET)         /*!< FLASH ECC register,                       Address offset: 0x18 */
#define _FLASH_OPTR         (FLASH + FLASH_OPTR_OFFSET)         /*!< FLASH option register,                    Address offset: 0x20 */
#define _FLASH_PCROP1SR     (FLASH + FLASH_PCROP1SR_OFFSET)     /*!< FLASH bank1 PCROP start address register, Address offset: 0x24 */
#define _FLASH_PCROP1ER     (FLASH + FLASH_PCROP1ER_OFFSET)     /*!< FLASH bank1 PCROP end address register,   Address offset: 0x28 */
#define _FLASH_WRP1AR       (FLASH + FLASH_WRP1AR_OFFSET)       /*!< FLASH bank1 WRP area A address register,  Address offset: 0x2C */
#define _FLASH_WRP1BR       (FLASH + FLASH_WRP1BR_OFFSET)       /*!< FLASH bank1 WRP area B address register,  Address offset: 0x30 */

#define CRC                 (CRC_BASE)
#define _CRC_DR           (CRC + CRC_DR_OFFSET)           /*!< CRC Data register,                           Address offset: 0x00 */
#define _CRC_IDR          (CRC + CRC_IDR_OFFSET)          /*!< CRC Independent data register,               Address offset: 0x04 */
#define _CRC_CR           (CRC + CRC_CR_OFFSET)           /*!< CRC Control register,                        Address offset: 0x08 */
#define _CRC_INIT         (CRC + CRC_INIT_OFFSET)         /*!< Initial CRC value register,                  Address offset: 0x10 */
#define _CRC_POL          (CRC + CRC_POL_OFFSET)          /*!< CRC polynomial register,                     Address offset: 0x14 */

#define TSC                 (TSC_BASE)
#define _TSC_CR           (TSC + TSC_CR_OFFSET)           /*!< TSC control register,                                     Address offset: 0x00 */
#define _TSC_IER          (TSC + TSC_IER_OFFSET)          /*!< TSC interrupt enable register,                            Address offset: 0x04 */
#define _TSC_ICR          (TSC + TSC_ICR_OFFSET)          /*!< TSC interrupt clear register,                             Address offset: 0x08 */
#define _TSC_ISR          (TSC + TSC_ISR_OFFSET)          /*!< TSC interrupt status register,                            Address offset: 0x0C */
#define _TSC_IOHCR        (TSC + TSC_IOHCR_OFFSET)        /*!< TSC I/O hysteresis control register,                      Address offset: 0x10 */
#define _TSC_IOASCR       (TSC + TSC_IOASCR_OFFSET)       /*!< TSC I/O analog switch control register,                   Address offset: 0x18 */
#define _TSC_IOSCR        (TSC + TSC_IOSCR_OFFSET)        /*!< TSC I/O sampling control register,                        Address offset: 0x20 */
#define _TSC_IOCCR        (TSC + TSC_IOCCR_OFFSET)        /*!< TSC I/O channel control register,                         Address offset: 0x28 */
#define _TSC_IOGCSR       (TSC + TSC_IOGCSR_OFFSET)       /*!< TSC I/O group control status register,                    Address offset: 0x30 */
#define _TSC_IOGXCR       (TSC + TSC_IOGXCR_OFFSET)       /*!< TSC I/O group x counter register,                         Address offset: 0x34-4C */


