the-nw1-group/acb-modules/acb-common/include/stm/stm32l431xx.inc
#define GPIOA               (GPIOA_BASE)
#define _GPIOA_MODER      (GPIOA + GPIO_MODER_OFFSET)      /*!< GPIO port mode register,               Address offset: 0x00      */
#define _GPIOA_OTYPER     (GPIOA + GPIO_OTYPER_OFFSET)     /*!< GPIO port output type register,        Address offset: 0x04      */
#define _GPIOA_OSPEEDR    (GPIOA + GPIO_OSPEEDR_OFFSET)    /*!< GPIO port output speed register,       Address offset: 0x08      */
#define _GPIOA_PUPDR      (GPIOA + GPIO_PUPDR_OFFSET)      /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C      */
#define _GPIOA_IDR        (GPIOA + GPIO_IDR_OFFSET)        /*!< GPIO port input data register,         Address offset: 0x10      */
#define _GPIOA_ODR        (GPIOA + GPIO_ODR_OFFSET)        /*!< GPIO port output data register,        Address offset: 0x14      */
#define _GPIOA_BSRR       (GPIOA + GPIO_BSRR_OFFSET)       /*!< GPIO port bit set/reset  register,     Address offset: 0x18      */
#define _GPIOA_LCKR       (GPIOA + GPIO_LCKR_OFFSET)       /*!< GPIO port configuration lock register, Address offset: 0x1C      */
#define _GPIOA_AFR        (GPIOA + GPIO_AFR_OFFSET)        /*!< GPIO alternate function registers,     Address offset: 0x20-0x24 */
#define _GPIOA_BRR        (GPIOA + GPIO_BRR_OFFSET)        /*!< GPIO Bit Reset register,               Address offset: 0x28      */

#define GPIOB               (GPIOB_BASE)
#define _GPIOB_MODER      (GPIOB + GPIO_MODER_OFFSET)      /*!< GPIO port mode register,               Address offset: 0x00      */
#define _GPIOB_OTYPER     (GPIOB + GPIO_OTYPER_OFFSET)     /*!< GPIO port output type register,        Address offset: 0x04      */
#define _GPIOB_OSPEEDR    (GPIOB + GPIO_OSPEEDR_OFFSET)    /*!< GPIO port output speed register,       Address offset: 0x08      */
#define _GPIOB_PUPDR      (GPIOB + GPIO_PUPDR_OFFSET)      /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C      */
#define _GPIOB_IDR        (GPIOB + GPIO_IDR_OFFSET)        /*!< GPIO port input data register,         Address offset: 0x10      */
#define _GPIOB_ODR        (GPIOB + GPIO_ODR_OFFSET)        /*!< GPIO port output data register,        Address offset: 0x14      */
#define _GPIOB_BSRR       (GPIOB + GPIO_BSRR_OFFSET)       /*!< GPIO port bit set/reset  register,     Address offset: 0x18      */
#define _GPIOB_LCKR       (GPIOB + GPIO_LCKR_OFFSET)       /*!< GPIO port configuration lock register, Address offset: 0x1C      */
#define _GPIOB_AFR        (GPIOB + GPIO_AFR_OFFSET)        /*!< GPIO alternate function registers,     Address offset: 0x20-0x24 */
#define _GPIOB_BRR        (GPIOB + GPIO_BRR_OFFSET)        /*!< GPIO Bit Reset register,               Address offset: 0x28      */

#define GPIOC               (GPIOC_BASE)
#define _GPIOC_MODER      (GPIOC + GPIO_MODER_OFFSET)      /*!< GPIO port mode register,               Address offset: 0x00      */
#define _GPIOC_OTYPER     (GPIOC + GPIO_OTYPER_OFFSET)     /*!< GPIO port output type register,        Address offset: 0x04      */
#define _GPIOC_OSPEEDR    (GPIOC + GPIO_OSPEEDR_OFFSET)    /*!< GPIO port output speed register,       Address offset: 0x08      */
#define _GPIOC_PUPDR      (GPIOC + GPIO_PUPDR_OFFSET)      /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C      */
#define _GPIOC_IDR        (GPIOC + GPIO_IDR_OFFSET)        /*!< GPIO port input data register,         Address offset: 0x10      */
#define _GPIOC_ODR        (GPIOC + GPIO_ODR_OFFSET)        /*!< GPIO port output data register,        Address offset: 0x14      */
#define _GPIOC_BSRR       (GPIOC + GPIO_BSRR_OFFSET)       /*!< GPIO port bit set/reset  register,     Address offset: 0x18      */
#define _GPIOC_LCKR       (GPIOC + GPIO_LCKR_OFFSET)       /*!< GPIO port configuration lock register, Address offset: 0x1C      */
#define _GPIOC_AFR        (GPIOC + GPIO_AFR_OFFSET)        /*!< GPIO alternate function registers,     Address offset: 0x20-0x24 */
#define _GPIOC_BRR        (GPIOC + GPIO_BRR_OFFSET)        /*!< GPIO Bit Reset register,               Address offset: 0x28      */

#define GPIOD               (GPIOD_BASE)
#define _GPIOD_MODER      (GPIOD + GPIO_MODER_OFFSET)      /*!< GPIO port mode register,               Address offset: 0x00      */
#define _GPIOD_OTYPER     (GPIOD + GPIO_OTYPER_OFFSET)     /*!< GPIO port output type register,        Address offset: 0x04      */
#define _GPIOD_OSPEEDR    (GPIOD + GPIO_OSPEEDR_OFFSET)    /*!< GPIO port output speed register,       Address offset: 0x08      */
#define _GPIOD_PUPDR      (GPIOD + GPIO_PUPDR_OFFSET)      /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C      */
#define _GPIOD_IDR        (GPIOD + GPIO_IDR_OFFSET)        /*!< GPIO port input data register,         Address offset: 0x10      */
#define _GPIOD_ODR        (GPIOD + GPIO_ODR_OFFSET)        /*!< GPIO port output data register,        Address offset: 0x14      */
#define _GPIOD_BSRR       (GPIOD + GPIO_BSRR_OFFSET)       /*!< GPIO port bit set/reset  register,     Address offset: 0x18      */
#define _GPIOD_LCKR       (GPIOD + GPIO_LCKR_OFFSET)       /*!< GPIO port configuration lock register, Address offset: 0x1C      */
#define _GPIOD_AFR        (GPIOD + GPIO_AFR_OFFSET)        /*!< GPIO alternate function registers,     Address offset: 0x20-0x24 */
#define _GPIOD_BRR        (GPIOD + GPIO_BRR_OFFSET)        /*!< GPIO Bit Reset register,               Address offset: 0x28      */

#define GPIOE               (GPIOE_BASE)
#define _GPIOE_MODER      (GPIOE + GPIO_MODER_OFFSET)      /*!< GPIO port mode register,               Address offset: 0x00      */
#define _GPIOE_OTYPER     (GPIOE + GPIO_OTYPER_OFFSET)     /*!< GPIO port output type register,        Address offset: 0x04      */
#define _GPIOE_OSPEEDR    (GPIOE + GPIO_OSPEEDR_OFFSET)    /*!< GPIO port output speed register,       Address offset: 0x08      */
#define _GPIOE_PUPDR      (GPIOE + GPIO_PUPDR_OFFSET)      /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C      */
#define _GPIOE_IDR        (GPIOE + GPIO_IDR_OFFSET)        /*!< GPIO port input data register,         Address offset: 0x10      */
#define _GPIOE_ODR        (GPIOE + GPIO_ODR_OFFSET)        /*!< GPIO port output data register,        Address offset: 0x14      */
#define _GPIOE_BSRR       (GPIOE + GPIO_BSRR_OFFSET)       /*!< GPIO port bit set/reset  register,     Address offset: 0x18      */
#define _GPIOE_LCKR       (GPIOE + GPIO_LCKR_OFFSET)       /*!< GPIO port configuration lock register, Address offset: 0x1C      */
#define _GPIOE_AFR        (GPIOE + GPIO_AFR_OFFSET)        /*!< GPIO alternate function registers,     Address offset: 0x20-0x24 */
#define _GPIOE_BRR        (GPIOE + GPIO_BRR_OFFSET)        /*!< GPIO Bit Reset register,               Address offset: 0x28      */

#define GPIOH               (GPIOH_BASE)
#define _GPIOH_MODER      (GPIOH + GPIO_MODER_OFFSET)      /*!< GPIO port mode register,               Address offset: 0x00      */
#define _GPIOH_OTYPER     (GPIOH + GPIO_OTYPER_OFFSET)     /*!< GPIO port output type register,        Address offset: 0x04      */
#define _GPIOH_OSPEEDR    (GPIOH + GPIO_OSPEEDR_OFFSET)    /*!< GPIO port output speed register,       Address offset: 0x08      */
#define _GPIOH_PUPDR      (GPIOH + GPIO_PUPDR_OFFSET)      /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C      */
#define _GPIOH_IDR        (GPIOH + GPIO_IDR_OFFSET)        /*!< GPIO port input data register,         Address offset: 0x10      */
#define _GPIOH_ODR        (GPIOH + GPIO_ODR_OFFSET)        /*!< GPIO port output data register,        Address offset: 0x14      */
#define _GPIOH_BSRR       (GPIOH + GPIO_BSRR_OFFSET)       /*!< GPIO port bit set/reset  register,     Address offset: 0x18      */
#define _GPIOH_LCKR       (GPIOH + GPIO_LCKR_OFFSET)       /*!< GPIO port configuration lock register, Address offset: 0x1C      */
#define _GPIOH_AFR        (GPIOH + GPIO_AFR_OFFSET)        /*!< GPIO alternate function registers,     Address offset: 0x20-0x24 */
#define _GPIOH_BRR        (GPIOH + GPIO_BRR_OFFSET)        /*!< GPIO Bit Reset register,               Address offset: 0x28      */

#define ADC1                (ADC1_BASE)
#define _ADC1_ISR          (ADC1 + ADC_ISR_OFFSET)          /*!< ADC interrupt and status register,             Address offset: 0x00 */
#define _ADC1_IER          (ADC1 + ADC_IER_OFFSET)          /*!< ADC interrupt enable register,                 Address offset: 0x04 */
#define _ADC1_CR           (ADC1 + ADC_CR_OFFSET)           /*!< ADC control register,                          Address offset: 0x08 */
#define _ADC1_CFGR         (ADC1 + ADC_CFGR_OFFSET)         /*!< ADC configuration register 1,                  Address offset: 0x0C */
#define _ADC1_CFGR2        (ADC1 + ADC_CFGR2_OFFSET)        /*!< ADC configuration register 2,                  Address offset: 0x10 */
#define _ADC1_SMPR1        (ADC1 + ADC_SMPR1_OFFSET)        /*!< ADC sampling time register 1,                  Address offset: 0x14 */
#define _ADC1_SMPR2        (ADC1 + ADC_SMPR2_OFFSET)        /*!< ADC sampling time register 2,                  Address offset: 0x18 */
#define _ADC1_TR1          (ADC1 + ADC_TR1_OFFSET)          /*!< ADC analog watchdog 1 threshold register,      Address offset: 0x20 */
#define _ADC1_TR2          (ADC1 + ADC_TR2_OFFSET)          /*!< ADC analog watchdog 2 threshold register,      Address offset: 0x24 */
#define _ADC1_TR3          (ADC1 + ADC_TR3_OFFSET)          /*!< ADC analog watchdog 3 threshold register,      Address offset: 0x28 */
#define _ADC1_SQR1         (ADC1 + ADC_SQR1_OFFSET)         /*!< ADC group regular sequencer register 1,        Address offset: 0x30 */
#define _ADC1_SQR2         (ADC1 + ADC_SQR2_OFFSET)         /*!< ADC group regular sequencer register 2,        Address offset: 0x34 */
#define _ADC1_SQR3         (ADC1 + ADC_SQR3_OFFSET)         /*!< ADC group regular sequencer register 3,        Address offset: 0x38 */
#define _ADC1_SQR4         (ADC1 + ADC_SQR4_OFFSET)         /*!< ADC group regular sequencer register 4,        Address offset: 0x3C */
#define _ADC1_DR           (ADC1 + ADC_DR_OFFSET)           /*!< ADC group regular data register,               Address offset: 0x40 */
#define _ADC1_JSQR         (ADC1 + ADC_JSQR_OFFSET)         /*!< ADC group injected sequencer register,         Address offset: 0x4C */
#define _ADC1_OFR1         (ADC1 + ADC_OFR1_OFFSET)         /*!< ADC offset register 1,                         Address offset: 0x60 */
#define _ADC1_OFR2         (ADC1 + ADC_OFR2_OFFSET)         /*!< ADC offset register 2,                         Address offset: 0x64 */
#define _ADC1_OFR3         (ADC1 + ADC_OFR3_OFFSET)         /*!< ADC offset register 3,                         Address offset: 0x68 */
#define _ADC1_OFR4         (ADC1 + ADC_OFR4_OFFSET)         /*!< ADC offset register 4,                         Address offset: 0x6C */
#define _ADC1_JDR1         (ADC1 + ADC_JDR1_OFFSET)         /*!< ADC group injected rank 1 data register,       Address offset: 0x80 */
#define _ADC1_JDR2         (ADC1 + ADC_JDR2_OFFSET)         /*!< ADC group injected rank 2 data register,       Address offset: 0x84 */
#define _ADC1_JDR3         (ADC1 + ADC_JDR3_OFFSET)         /*!< ADC group injected rank 3 data register,       Address offset: 0x88 */
#define _ADC1_JDR4         (ADC1 + ADC_JDR4_OFFSET)         /*!< ADC group injected rank 4 data register,       Address offset: 0x8C */
#define _ADC1_AWD2CR       (ADC1 + ADC_AWD2CR_OFFSET)       /*!< ADC analog watchdog 1 configuration register,  Address offset: 0xA0 */
#define _ADC1_AWD3CR       (ADC1 + ADC_AWD3CR_OFFSET)       /*!< ADC analog watchdog 3 Configuration Register,  Address offset: 0xA4 */
#define _ADC1_DIFSEL       (ADC1 + ADC_DIFSEL_OFFSET)       /*!< ADC differential mode selection register,      Address offset: 0xB0 */
#define _ADC1_CALFACT      (ADC1 + ADC_CALFACT_OFFSET)      /*!< ADC calibration factors,                       Address offset: 0xB4 */

#define ADC1_COMMON         (ADC1_COMMON_BASE)
#define _ADC1_COMMON_CCR          (ADC1_COMMON + ADC_Common_CCR_OFFSET)          /*!< ADC common configuration register,             Address offset: ADC1 base address + 0x308 */

