the-nw1-group/acb-modules/acb-common/include/stm/stm32l431xx.inc
#define RNG                 (RNG_BASE)
#define _RNG_CR    (RNG + RNG_CR_OFFSET)    /*!< RNG control register, Address offset: 0x00 */
#define _RNG_SR    (RNG + RNG_SR_OFFSET)    /*!< RNG status register,  Address offset: 0x04 */
#define _RNG_DR    (RNG + RNG_DR_OFFSET)    /*!< RNG data register,    Address offset: 0x08 */



#define DMA1_Channel1       (DMA1_Channel1_BASE)
#define _DMA1_Channel1_CCR      (DMA1_Channel1 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register        */
#define _DMA1_Channel1_CNDTR    (DMA1_Channel1 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register       */
#define _DMA1_Channel1_CPAR     (DMA1_Channel1 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register   */
#define _DMA1_Channel1_CMAR     (DMA1_Channel1 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register       */

#define DMA1_Channel2       (DMA1_Channel2_BASE)
#define _DMA1_Channel2_CCR      (DMA1_Channel2 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register        */
#define _DMA1_Channel2_CNDTR    (DMA1_Channel2 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register       */
#define _DMA1_Channel2_CPAR     (DMA1_Channel2 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register   */
#define _DMA1_Channel2_CMAR     (DMA1_Channel2 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register       */

#define DMA1_Channel3       (DMA1_Channel3_BASE)
#define _DMA1_Channel3_CCR      (DMA1_Channel3 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register        */
#define _DMA1_Channel3_CNDTR    (DMA1_Channel3 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register       */
#define _DMA1_Channel3_CPAR     (DMA1_Channel3 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register   */
#define _DMA1_Channel3_CMAR     (DMA1_Channel3 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register       */

#define DMA1_Channel4       (DMA1_Channel4_BASE)
#define _DMA1_Channel4_CCR      (DMA1_Channel4 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register        */
#define _DMA1_Channel4_CNDTR    (DMA1_Channel4 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register       */
#define _DMA1_Channel4_CPAR     (DMA1_Channel4 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register   */
#define _DMA1_Channel4_CMAR     (DMA1_Channel4 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register       */

#define DMA1_Channel5       (DMA1_Channel5_BASE)
#define _DMA1_Channel5_CCR      (DMA1_Channel5 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register        */
#define _DMA1_Channel5_CNDTR    (DMA1_Channel5 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register       */
#define _DMA1_Channel5_CPAR     (DMA1_Channel5 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register   */
#define _DMA1_Channel5_CMAR     (DMA1_Channel5 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register       */

#define DMA1_Channel6       (DMA1_Channel6_BASE)
#define _DMA1_Channel6_CCR      (DMA1_Channel6 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register        */
#define _DMA1_Channel6_CNDTR    (DMA1_Channel6 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register       */
#define _DMA1_Channel6_CPAR     (DMA1_Channel6 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register   */
#define _DMA1_Channel6_CMAR     (DMA1_Channel6 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register       */

#define DMA1_Channel7       (DMA1_Channel7_BASE)
#define _DMA1_Channel7_CCR      (DMA1_Channel7 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register        */
#define _DMA1_Channel7_CNDTR    (DMA1_Channel7 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register       */
#define _DMA1_Channel7_CPAR     (DMA1_Channel7 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register   */
#define _DMA1_Channel7_CMAR     (DMA1_Channel7 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register       */

#define DMA1_CSELR          (DMA1_CSELR_BASE)
#define _DMA1_CSELR_CSELR    (DMA1_CSELR + DMA_Request_CSELR_OFFSET)    /*!< DMA channel selection register              */



#define DMA2_Channel1       (DMA2_Channel1_BASE)
#define _DMA2_Channel1_CCR      (DMA2_Channel1 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register        */
#define _DMA2_Channel1_CNDTR    (DMA2_Channel1 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register       */
#define _DMA2_Channel1_CPAR     (DMA2_Channel1 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register   */
#define _DMA2_Channel1_CMAR     (DMA2_Channel1 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register       */

#define DMA2_Channel2       (DMA2_Channel2_BASE)
#define _DMA2_Channel2_CCR      (DMA2_Channel2 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register        */
#define _DMA2_Channel2_CNDTR    (DMA2_Channel2 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register       */
#define _DMA2_Channel2_CPAR     (DMA2_Channel2 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register   */
#define _DMA2_Channel2_CMAR     (DMA2_Channel2 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register       */

#define DMA2_Channel3       (DMA2_Channel3_BASE)
#define _DMA2_Channel3_CCR      (DMA2_Channel3 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register        */
#define _DMA2_Channel3_CNDTR    (DMA2_Channel3 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register       */
#define _DMA2_Channel3_CPAR     (DMA2_Channel3 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register   */
#define _DMA2_Channel3_CMAR     (DMA2_Channel3 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register       */

#define DMA2_Channel4       (DMA2_Channel4_BASE)
#define _DMA2_Channel4_CCR      (DMA2_Channel4 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register        */
#define _DMA2_Channel4_CNDTR    (DMA2_Channel4 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register       */
#define _DMA2_Channel4_CPAR     (DMA2_Channel4 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register   */
#define _DMA2_Channel4_CMAR     (DMA2_Channel4 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register       */

#define DMA2_Channel5       (DMA2_Channel5_BASE)
#define _DMA2_Channel5_CCR      (DMA2_Channel5 + DMA_Channel_CCR_OFFSET)      /*!< DMA channel x configuration register        */
#define _DMA2_Channel5_CNDTR    (DMA2_Channel5 + DMA_Channel_CNDTR_OFFSET)    /*!< DMA channel x number of data register       */
#define _DMA2_Channel5_CPAR     (DMA2_Channel5 + DMA_Channel_CPAR_OFFSET)     /*!< DMA channel x peripheral address register   */
#define _DMA2_Channel5_CMAR     (DMA2_Channel5 + DMA_Channel_CMAR_OFFSET)     /*!< DMA channel x memory address register       */

